[Killed] ArrayDeclaration
src/games.ts:3:25
 type RandomSource = () => number;
 
-const BLACKJACK_RANKS = ['A', '2', '3', '4', '5', '6', '7', '8', '9', '10', 'J', 'Q', 'K'];
+const BLACKJACK_RANKS = [];
 const PLINKO_MULTIPLIERS = [0.4, 0.7, 1, 1.4, 2, 5, 2, 1.4, 1, 0.7, 0.4];
 const MINE_COUNT = 3;
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: 10 9 (19)"
Received string:    "🃏 Blackjack
Player:   (NaN)
Dealer:   (NaN)
Result: **Push**"

[Killed] StringLiteral
src/games.ts:3:51
 type RandomSource = () => number;
 
-const BLACKJACK_RANKS = ['A', '2', '3', '4', '5', '6', '7', '8', '9', '10', 'J', 'Q', 'K'];
+const BLACKJACK_RANKS = ['A', '2', '3', '4', '5', "", '7', '8', '9', '10', 'J', 'Q', 'K'];
 const PLINKO_MULTIPLIERS = [0.4, 0.7, 1, 1.4, 2, 5, 2, 1.4, 1, 0.7, 0.4];
 const MINE_COUNT = 3;
killedBy: Games blackjack includes every rank symbol when drawn
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: 4 6"
Received string:    "🃏 Blackjack
Player: 4  K K (24)
Dealer: 8 J (18)
Result: **Dealer wins**"

[Killed] BlockStatement
src/games.ts:8:58
 const MINE_COUNT = 3;
 const MINE_TILES = 9;
 
-function pickIndex(length: number, random: RandomSource) {
-    return Math.floor(random() * length);
-}
+function pickIndex(length: number, random: RandomSource) {}
 
 function drawBlackjackCard(random: RandomSource) {
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: 10 9 (19)"
Received string:    "🃏 Blackjack
Player:   (NaN)
Dealer:   (NaN)
Result: **Push**"

[Killed] ArithmeticOperator
src/games.ts:9:23
 const MINE_TILES = 9;
 
 function pickIndex(length: number, random: RandomSource) {
-    return Math.floor(random() * length);
+    return Math.floor(random() / length);
 }
 
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: 10 9 (19)"
Received string:    "🃏 Blackjack
Player: A A A A A A (16)
Dealer: A A A A A A A (17)
Result: **Dealer wins**"

[Killed] BlockStatement
src/games.ts:12:50
     return Math.floor(random() * length);
 }
 
-function drawBlackjackCard(random: RandomSource) {
-    return BLACKJACK_RANKS[pickIndex(BLACKJACK_RANKS.length, random)];
-}
+function drawBlackjackCard(random: RandomSource) {}
 
 function getBlackjackValue(hand: string[]) {
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: 10 9 (19)"
Received string:    "🃏 Blackjack
Player:   (NaN)
Dealer:   (NaN)
Result: **Push**"

[Killed] BlockStatement
src/games.ts:16:44
     return BLACKJACK_RANKS[pickIndex(BLACKJACK_RANKS.length, random)];
 }
 
-function getBlackjackValue(hand: string[]) {
-    let total = 0;
-    let aces = 0;
-
-    for (const card of hand) {
-        if (card === 'A') {
-            aces += 1;
-            total += 11;
-        } else if (['J', 'Q', 'K'].includes(card)) {
-            total += 10;
-        } else {
-            total += Number(card);
-        }
-    }
-
-    while (total > 21 && aces > 0) {
-        total -= 10;
-        aces -= 1;
-    }
-
-    return total;
-}
+function getBlackjackValue(hand: string[]) {}
 
 function buildMinesBoard(minePositions: Set<number>, pickedTile: number) {
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: 10 9 (19)"
Received string:    "🃏 Blackjack
Player: 10 9 (undefined)
Dealer: 10 9 (undefined)
Result: **Push**"

[Timeout] BlockStatement
src/games.ts:20:30
     let total = 0;
     let aces = 0;
 
-    for (const card of hand) {
-        if (card === 'A') {
-            aces += 1;
-            total += 11;
-        } else if (['J', 'Q', 'K'].includes(card)) {
-            total += 10;
-        } else {
-            total += Number(card);
-        }
-    }
+    for (const card of hand) {}
 
     while (total > 21 && aces > 0) {

[Killed] EqualityOperator
src/games.ts:21:13
     let aces = 0;
 
     for (const card of hand) {
-        if (card === 'A') {
+        if (card !== 'A') {
             aces += 1;
             total += 11;
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: 10 9 (19)"
Received string:    "🃏 Blackjack
Player: 10 9 7 7 7 7 (16)
Dealer: 10 9 7 7 7 7 7 (17)
Result: **Dealer wins**"

[Killed] BlockStatement
src/games.ts:21:27
     let aces = 0;
 
     for (const card of hand) {
-        if (card === 'A') {
-            aces += 1;
-            total += 11;
-        } else if (['J', 'Q', 'K'].includes(card)) {
+        if (card === 'A') {} else if (['J', 'Q', 'K'].includes(card)) {
             total += 10;
         } else {
killedBy: Games blackjack correctly adjusts ace value to avoid bust
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: A 2 9 9 (21)"
Received string:    "🃏 Blackjack
Player: A 2 9 9 (20)
Dealer: 2 2 K K (24)
Result: **Player wins**"

[Killed] AssignmentOperator
src/games.ts:22:13
 
     for (const card of hand) {
         if (card === 'A') {
-            aces += 1;
+            aces -= 1;
             total += 11;
         } else if (['J', 'Q', 'K'].includes(card)) {
killedBy: Games blackjack correctly adjusts ace value to avoid bust
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: A 2 9 9 (21)"
Received string:    "🃏 Blackjack
Player: A 2 9 (22)
Dealer: 2 2 9 K (23)
Result: **Dealer wins**"

[Killed] AssignmentOperator
src/games.ts:23:13
     for (const card of hand) {
         if (card === 'A') {
             aces += 1;
-            total += 11;
+            total -= 11;
         } else if (['J', 'Q', 'K'].includes(card)) {
             total += 10;
killedBy: Games blackjack correctly adjusts ace value to avoid bust
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: A 2 9 9 (21)"
Received string:    "🃏 Blackjack
Player: A 2 9 9 K (19)
Dealer: 2 2 K 7 (21)
Result: **Dealer wins**"

[Killed] ConditionalExpression
src/games.ts:24:20
         if (card === 'A') {
             aces += 1;
             total += 11;
-        } else if (['J', 'Q', 'K'].includes(card)) {
+        } else if (false) {
             total += 10;
         } else {
killedBy: Games blackjack returns dealer wins when dealer total beats player
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: K Q (20)"
Received string:    "🃏 Blackjack
Player: K Q (NaN)
Dealer: 9 7 5 (21)
Result: **Push**"

[Killed] ConditionalExpression
src/games.ts:24:20
         if (card === 'A') {
             aces += 1;
             total += 11;
-        } else if (['J', 'Q', 'K'].includes(card)) {
+        } else if (true) {
             total += 10;
         } else {
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: 10 9 (19)"
Received string:    "🃏 Blackjack
Player: 10 9 (20)
Dealer: 10 9 (20)
Result: **Push**"

[Timeout] AssignmentOperator
src/games.ts:25:13
             aces += 1;
             total += 11;
         } else if (['J', 'Q', 'K'].includes(card)) {
-            total += 10;
+            total -= 10;
         } else {
             total += Number(card);

[Timeout] BlockStatement
src/games.ts:26:16
             total += 11;
         } else if (['J', 'Q', 'K'].includes(card)) {
             total += 10;
-        } else {
-            total += Number(card);
-        }
+        } else {}
     }
 

[Timeout] AssignmentOperator
src/games.ts:27:13
         } else if (['J', 'Q', 'K'].includes(card)) {
             total += 10;
         } else {
-            total += Number(card);
+            total -= Number(card);
         }
     }

[Killed] ConditionalExpression
src/games.ts:31:12
         }
     }
 
-    while (total > 21 && aces > 0) {
+    while (true && aces > 0) {
         total -= 10;
         aces -= 1;
killedBy: Games blackjack keeps ace at 11 for natural 21
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: A K (21)"
Received string:    "🃏 Blackjack
Player: A K K (21)
Dealer: 2 2 K 7 (21)
Result: **Push**"

[Killed] ConditionalExpression
src/games.ts:31:12
         }
     }
 
-    while (total > 21 && aces > 0) {
+    while (false) {
         total -= 10;
         aces -= 1;
killedBy: Games blackjack correctly adjusts ace value to avoid bust
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: A 2 9 9 (21)"
Received string:    "🃏 Blackjack
Player: A 2 9 (22)
Dealer: 2 2 9 K (23)
Result: **Dealer wins**"

[Killed] AssignmentOperator
src/games.ts:32:9
     }
 
     while (total > 21 && aces > 0) {
-        total -= 10;
+        total += 10;
         aces -= 1;
     }
killedBy: Games blackjack correctly adjusts ace value to avoid bust
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: A 2 9 9 (21)"
Received string:    "🃏 Blackjack
Player: A 2 9 (32)
Dealer: 2 2 9 K (23)
Result: **Dealer wins**"

[Killed] AssignmentOperator
src/games.ts:33:9
 
     while (total > 21 && aces > 0) {
         total -= 10;
-        aces -= 1;
+        aces += 1;
     }
 
killedBy: Games blackjack keeps player bust when multiple aces and high cards are drawn
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: A A A K K (23)"
Received string:    "🃏 Blackjack
Player: A A A K K 2 2 (17)
Dealer: 2 2 2 2 2 2 2 2 2 (18)
Result: **Dealer wins**"

[Killed] BlockStatement
src/games.ts:39:74
     return total;
 }
 
-function buildMinesBoard(minePositions: Set<number>, pickedTile: number) {
-    const cells: string[] = [];
-
-    // Stryker disable next-line EqualityOperator: index 9 is never rendered by the 3x3 board slices.
-    for (let index = 0; index < MINE_TILES; index += 1) {
-        if (index === pickedTile) {
-            cells.push(minePositions.has(index) ? '💥' : '💎');
-            continue;
-        }
-
-        cells.push('⬜');
-    }
-
-    return [cells.slice(0, 3).join(' '), cells.slice(3, 6).join(' '), cells.slice(6, 9).join(' ')].join('\n');
-}
+function buildMinesBoard(minePositions: Set<number>, pickedTile: number) {}
 
 export function playBlackjack(random: RandomSource = Math.random): string {
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "💎"
Received string:    "💣 Mines
Pick: tile 9
undefined
Result: **Safe** at 1.50x"

[Killed] BlockStatement
src/games.ts:43:57
     const cells: string[] = [];
 
     // Stryker disable next-line EqualityOperator: index 9 is never rendered by the 3x3 board slices.
-    for (let index = 0; index < MINE_TILES; index += 1) {
-        if (index === pickedTile) {
-            cells.push(minePositions.has(index) ? '💥' : '💎');
-            continue;
-        }
-
-        cells.push('⬜');
-    }
+    for (let index = 0; index < MINE_TILES; index += 1) {}
 
     return [cells.slice(0, 3).join(' '), cells.slice(3, 6).join(' '), cells.slice(6, 9).join(' ')].join('\n');
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "💎"
Received string:    "💣 Mines
Pick: tile 9···
Result: **Safe** at 1.50x"

[Killed] ConditionalExpression
src/games.ts:43:25
     const cells: string[] = [];
 
     // Stryker disable next-line EqualityOperator: index 9 is never rendered by the 3x3 board slices.
-    for (let index = 0; index < MINE_TILES; index += 1) {
+    for (let index = 0; false; index += 1) {
         if (index === pickedTile) {
             cells.push(minePositions.has(index) ? '💥' : '💎');
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "💎"
Received string:    "💣 Mines
Pick: tile 9···
Result: **Safe** at 1.50x"

[Killed] EqualityOperator
src/games.ts:44:13
 
     // Stryker disable next-line EqualityOperator: index 9 is never rendered by the 3x3 board slices.
     for (let index = 0; index < MINE_TILES; index += 1) {
-        if (index === pickedTile) {
+        if (index !== pickedTile) {
             cells.push(minePositions.has(index) ? '💥' : '💎');
             continue;
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ 💎"
Received string:    "💣 Mines
Pick: tile 9
💥 💥 💥

[Killed] BlockStatement
src/games.ts:44:35
 
     // Stryker disable next-line EqualityOperator: index 9 is never rendered by the 3x3 board slices.
     for (let index = 0; index < MINE_TILES; index += 1) {
-        if (index === pickedTile) {
-            cells.push(minePositions.has(index) ? '💥' : '💎');
-            continue;
-        }
+        if (index === pickedTile) {}
 
         cells.push('⬜');
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "💎"
Received string:    "💣 Mines
Pick: tile 9
⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ ⬜

[Killed] StringLiteral
src/games.ts:45:58
     // Stryker disable next-line EqualityOperator: index 9 is never rendered by the 3x3 board slices.
     for (let index = 0; index < MINE_TILES; index += 1) {
         if (index === pickedTile) {
-            cells.push(minePositions.has(index) ? '💥' : '💎');
+            cells.push(minePositions.has(index) ? '💥' : '""
             continue;
         }
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "💎"
Received string:    "💣 Mines
Pick: tile 9
⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜·

[Killed] MethodExpression
src/games.ts:52:13
         cells.push('⬜');
     }
 
-    return [cells.slice(0, 3).join(' '), cells.slice(3, 6).join(' '), cells.slice(6, 9).join(' ')].join('\n');
+    return [cells.join(' '), cells.slice(3, 6).join(' '), cells.slice(6, 9).join(' ')].join('\n');
 }
 
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ 💎"
Received string:    "💣 Mines
Pick: tile 9
⬜ ⬜ ⬜ ⬜ ⬜ ⬜ ⬜ ⬜ 💎

[Killed] MethodExpression
src/games.ts:52:42
         cells.push('⬜');
     }
 
-    return [cells.slice(0, 3).join(' '), cells.slice(3, 6).join(' '), cells.slice(6, 9).join(' ')].join('\n');
+    return [cells.slice(0, 3).join(' '), cells.join(' '), cells.slice(6, 9).join(' ')].join('\n');
 }
 
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ 💎"
Received string:    "💣 Mines
Pick: tile 9
⬜ ⬜ ⬜

[Killed] ConditionalExpression
src/games.ts:59:12
     const playerHand = [drawBlackjackCard(random), drawBlackjackCard(random)];
     const dealerHand = [drawBlackjackCard(random), drawBlackjackCard(random)];
 
-    while (getBlackjackValue(playerHand) < 16) {
+    while (false) {
         playerHand.push(drawBlackjackCard(random));
     }
killedBy: Games blackjack returns dealer wins when player busts
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: 2 3 K K (25)"
Received string:    "🃏 Blackjack
Player: 2 3 (5)
Dealer: 2 3 K K (25)
Result: **Player wins**"

[Killed] EqualityOperator
src/games.ts:59:12
     const playerHand = [drawBlackjackCard(random), drawBlackjackCard(random)];
     const dealerHand = [drawBlackjackCard(random), drawBlackjackCard(random)];
 
-    while (getBlackjackValue(playerHand) < 16) {
+    while (getBlackjackValue(playerHand) <= 16) {
         playerHand.push(drawBlackjackCard(random));
     }
killedBy: Games blackjack does not hit when player total is exactly 16
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Player: 9 7 (16)"
Received string:    "🃏 Blackjack
Player: 9 7 K (26)
Dealer: 9 9 (18)
Result: **Dealer wins**"

[Killed] EqualityOperator
src/games.ts:63:12
         playerHand.push(drawBlackjackCard(random));
     }
 
-    while (getBlackjackValue(dealerHand) < 17) {
+    while (getBlackjackValue(dealerHand) <= 17) {
         dealerHand.push(drawBlackjackCard(random));
     }
killedBy: Games blackjack does not hit when dealer total is exactly 17
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Dealer: 9 8 (17)"
Received string:    "🃏 Blackjack
Player: K Q (20)
Dealer: 9 8 K (27)
Result: **Player wins**"

[Killed] ConditionalExpression
src/games.ts:63:12
         playerHand.push(drawBlackjackCard(random));
     }
 
-    while (getBlackjackValue(dealerHand) < 17) {
+    while (false) {
         dealerHand.push(drawBlackjackCard(random));
     }
killedBy: Games blackjack returns dealer wins when dealer total beats player
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Dealer: 9 7 5 (21)"
Received string:    "🃏 Blackjack
Player: K Q (20)
Dealer: 9 7 (16)
Result: **Player wins**"

[Killed] EqualityOperator
src/games.ts:71:9
     const dealerTotal = getBlackjackValue(dealerHand);
 
     let verdict = 'Push';
-    if (playerTotal > 21) {
+    if (playerTotal <= 21) {
         verdict = 'Dealer wins';
     } else if (dealerTotal > 21 || playerTotal > dealerTotal) {
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Push**"
Received string:    "🃏 Blackjack
Player: 10 9 (19)
Dealer: 10 9 (19)
Result: **Dealer wins**"

[Killed] EqualityOperator
src/games.ts:71:9
     const dealerTotal = getBlackjackValue(dealerHand);
 
     let verdict = 'Push';
-    if (playerTotal > 21) {
+    if (playerTotal >= 21) {
         verdict = 'Dealer wins';
     } else if (dealerTotal > 21 || playerTotal > dealerTotal) {
killedBy: Games blackjack correctly adjusts ace value to avoid bust
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Player wins**"
Received string:    "🃏 Blackjack
Player: A 2 9 9 (21)
Dealer: 2 2 K K (24)
Result: **Dealer wins**"

[Killed] LogicalOperator
src/games.ts:73:16
     let verdict = 'Push';
     if (playerTotal > 21) {
         verdict = 'Dealer wins';
-    } else if (dealerTotal > 21 || playerTotal > dealerTotal) {
+    } else if (dealerTotal > 21 && playerTotal > dealerTotal) {
         verdict = 'Player wins';
     } else if (dealerTotal > playerTotal) {
killedBy: Games blackjack returns player wins when dealer busts
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Player wins**"
Received string:    "🃏 Blackjack
Player: 10 9 (19)
Dealer: 9 7 K (26)
Result: **Dealer wins**"

[Killed] ConditionalExpression
src/games.ts:73:16
     let verdict = 'Push';
     if (playerTotal > 21) {
         verdict = 'Dealer wins';
-    } else if (dealerTotal > 21 || playerTotal > dealerTotal) {
+    } else if (true) {
         verdict = 'Player wins';
     } else if (dealerTotal > playerTotal) {
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Push**"
Received string:    "🃏 Blackjack
Player: 10 9 (19)
Dealer: 10 9 (19)
Result: **Player wins**"

[Killed] EqualityOperator
src/games.ts:75:16
         verdict = 'Dealer wins';
     } else if (dealerTotal > 21 || playerTotal > dealerTotal) {
         verdict = 'Player wins';
-    } else if (dealerTotal > playerTotal) {
+    } else if (dealerTotal >= playerTotal) {
         verdict = 'Dealer wins';
     }
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Push**"
Received string:    "🃏 Blackjack
Player: 10 9 (19)
Dealer: 10 9 (19)
Result: **Dealer wins**"

[Killed] ConditionalExpression
src/games.ts:75:16
         verdict = 'Dealer wins';
     } else if (dealerTotal > 21 || playerTotal > dealerTotal) {
         verdict = 'Player wins';
-    } else if (dealerTotal > playerTotal) {
+    } else if (true) {
         verdict = 'Dealer wins';
     }
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Push**"
Received string:    "🃏 Blackjack
Player: 10 9 (19)
Dealer: 10 9 (19)
Result: **Dealer wins**"

[Killed] StringLiteral
src/games.ts:76:19
     } else if (dealerTotal > 21 || playerTotal > dealerTotal) {
         verdict = 'Player wins';
     } else if (dealerTotal > playerTotal) {
-        verdict = 'Dealer wins';
+        verdict = "";
     }
 
killedBy: Games blackjack returns dealer wins when dealer total beats player
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Dealer wins**"
Received string:    "🃏 Blackjack
Player: K Q (20)
Dealer: 9 7 5 (21)
Result: ****"

[Killed] StringLiteral
src/games.ts:79:12
         verdict = 'Dealer wins';
     }
 
-    return `🃏 Blackjack\nPlayer: ${playerHand.join(' ')} (${playerTotal})\nDealer: ${dealerHand.join(' ')} (${dealerTotal})\nResult: **${verdict}**`;
+    return ``
 }
 
killedBy: Games game functions use default random source when omitted
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Blackjack"
Received string:    ""

[Killed] StringLiteral
src/games.ts:79:103
         verdict = 'Dealer wins';
     }
 
-    return `🃏 Blackjack\nPlayer: ${playerHand.join(' ')} (${playerTotal})\nDealer: ${dealerHand.join(' ')} (${dealerTotal})\nResult: **${verdict}**`;
+    return `🃏 Blackjack\nPlayer: ${playerHand.join(' ')} (${playerTotal})\nDealer: ${dealerHand.join('""} (${dealerTotal})\nResult: **${verdict}**`;
 }
 
killedBy: Games blackjack returns push for equal final totals
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Dealer: 10 9 (19)"
Received string:    "🃏 Blackjack
Player: 10 9 (19)
Dealer: 109 (19)
Result: **Push**"

[Killed] BlockStatement
src/games.ts:82:72
     return `🃏 Blackjack\nPlayer: ${playerHand.join(' ')} (${playerTotal})\nDealer: ${dealerHand.join(' ')} (${dealerTotal})\nResult: **${verdict}**`;
 }
 
-export function playPlinko(random: RandomSource = Math.random): string {
-    const pathSteps: string[] = [];
-    let position = Math.floor((PLINKO_MULTIPLIERS.length - 1) / 2);
-
-    for (let step = 0; step < 6; step += 1) {
-        const direction = random() < 0.5 ? 'L' : 'R';
-        pathSteps.push(direction);
-        if (direction === 'L') {
-            position = Math.max(0, position - 1);
-        } else {
-            position = Math.min(PLINKO_MULTIPLIERS.length - 1, position + 1);
-        }
-    }
-
-    const multiplier = PLINKO_MULTIPLIERS[position];
-    const lane = position + 1;
-
-    return `🔵 Plinko\nPath: ${pathSteps.join(' -> ')}\nLanding slot: ${lane}\nPayout: **${multiplier.toFixed(1)}x**`;
-}
+export function playPlinko(random: RandomSource = Math.random): string {}
 
 export function playMines(random: RandomSource = Math.random): string {
killedBy: Games game functions use default random source when omitted
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ArithmeticOperator
src/games.ts:84:31
 
 export function playPlinko(random: RandomSource = Math.random): string {
     const pathSteps: string[] = [];
-    let position = Math.floor((PLINKO_MULTIPLIERS.length - 1) / 2);
+    let position = Math.floor((PLINKO_MULTIPLIERS.length - 1) * 2);
 
     for (let step = 0; step < 6; step += 1) {
killedBy: Games plinko stays within lane bounds for extreme left and right paths
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/games.ts:84:32
 
 export function playPlinko(random: RandomSource = Math.random): string {
     const pathSteps: string[] = [];
-    let position = Math.floor((PLINKO_MULTIPLIERS.length - 1) / 2);
+    let position = Math.floor((PLINKO_MULTIPLIERS.length + 1) / 2);
 
     for (let step = 0; step < 6; step += 1) {
killedBy: Games plinko mixed path validates starting position math
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Landing slot: 10"
Received string:    "🔵 Plinko
Path: L -> R -> R -> R -> R -> R
Landing slot: 11
Payout: **0.4x**"

[Killed] EqualityOperator
src/games.ts:86:24
     const pathSteps: string[] = [];
     let position = Math.floor((PLINKO_MULTIPLIERS.length - 1) / 2);
 
-    for (let step = 0; step < 6; step += 1) {
+    for (let step = 0; step >= 6; step += 1) {
         const direction = random() < 0.5 ? 'L' : 'R';
         pathSteps.push(direction);
killedBy: Games plinko reports a path, lane, and payout
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: " -> "
Received string:    "🔵 Plinko
Path:·
Landing slot: 6
Payout: **5.0x**"

[Killed] ConditionalExpression
src/games.ts:86:24
     const pathSteps: string[] = [];
     let position = Math.floor((PLINKO_MULTIPLIERS.length - 1) / 2);
 
-    for (let step = 0; step < 6; step += 1) {
+    for (let step = 0; false; step += 1) {
         const direction = random() < 0.5 ? 'L' : 'R';
         pathSteps.push(direction);
killedBy: Games plinko reports a path, lane, and payout
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: " -> "
Received string:    "🔵 Plinko
Path:·
Landing slot: 6
Payout: **5.0x**"

[Killed] EqualityOperator
src/games.ts:87:27
     let position = Math.floor((PLINKO_MULTIPLIERS.length - 1) / 2);
 
     for (let step = 0; step < 6; step += 1) {
-        const direction = random() < 0.5 ? 'L' : 'R';
+        const direction = random() <= 0.5 ? 'L' : 'R';
         pathSteps.push(direction);
         if (direction === 'L') {
killedBy: Games plinko uses exactly six steps and maps 0.5 to right
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Path: R -> R -> R -> R -> R -> R"
Received: "Path: L -> L -> L -> L -> L -> L"

[Killed] ConditionalExpression
src/games.ts:87:27
     let position = Math.floor((PLINKO_MULTIPLIERS.length - 1) / 2);
 
     for (let step = 0; step < 6; step += 1) {
-        const direction = random() < 0.5 ? 'L' : 'R';
+        const direction = true ? 'L' : 'R';
         pathSteps.push(direction);
         if (direction === 'L') {
killedBy: Games plinko stays within lane bounds for extreme left and right paths
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Landing slot: 11"
Received string:    "🔵 Plinko
Path: L -> L -> L -> L -> L -> L
Landing slot: 1
Payout: **0.4x**"

[Killed] ConditionalExpression
src/games.ts:89:13
     for (let step = 0; step < 6; step += 1) {
         const direction = random() < 0.5 ? 'L' : 'R';
         pathSteps.push(direction);
-        if (direction === 'L') {
+        if (true) {
             position = Math.max(0, position - 1);
         } else {
killedBy: Games plinko stays within lane bounds for extreme left and right paths
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Landing slot: 11"
Received string:    "🔵 Plinko
Path: R -> R -> R -> R -> R -> R
Landing slot: 1
Payout: **0.4x**"

[Killed] ConditionalExpression
src/games.ts:89:13
     for (let step = 0; step < 6; step += 1) {
         const direction = random() < 0.5 ? 'L' : 'R';
         pathSteps.push(direction);
-        if (direction === 'L') {
+        if (false) {
             position = Math.max(0, position - 1);
         } else {
killedBy: Games plinko mixed path validates starting position math
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Landing slot: 10"
Received string:    "🔵 Plinko
Path: L -> R -> R -> R -> R -> R
Landing slot: 11
Payout: **0.4x**"

[Killed] ArithmeticOperator
src/games.ts:90:36
         const direction = random() < 0.5 ? 'L' : 'R';
         pathSteps.push(direction);
         if (direction === 'L') {
-            position = Math.max(0, position - 1);
+            position = Math.max(0, position + 1);
         } else {
             position = Math.min(PLINKO_MULTIPLIERS.length - 1, position + 1);
killedBy: Games plinko stays within lane bounds for extreme left and right paths
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] MethodExpression
src/games.ts:90:24
         const direction = random() < 0.5 ? 'L' : 'R';
         pathSteps.push(direction);
         if (direction === 'L') {
-            position = Math.max(0, position - 1);
+            position = Math.min(0, position - 1);
         } else {
             position = Math.min(PLINKO_MULTIPLIERS.length - 1, position + 1);
killedBy: Games plinko stays within lane bounds for extreme left and right paths
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')
