[Killed] BlockStatement
src/audit-log.ts:5:147
 // Only logs actions for users and Discord servers on this bot
 import { getDbConnection } from './db';
 
-export async function logOperation({ userId, serverId, action, details }: { userId: string, serverId: string, action: string, details?: string }) {
-  const db = await getDbConnection();
-  try {
-    await db.execute(
-      'INSERT INTO audit_logs (user_id, server_id, action, details) VALUES (?, ?, ?, ?)',
-      [userId, serverId, action, details || null]
-    );
-  } finally {
-    await db.end();
-  }
-}
+export async function logOperation({ userId, serverId, action, details }: { userId: string, serverId: string, action: string, details?: string }) {}
 
 // Example usage:
killedBy: audit-log writes audit row and closes connection
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/audit-log.ts:7:7
 
 export async function logOperation({ userId, serverId, action, details }: { userId: string, serverId: string, action: string, details?: string }) {
   const db = await getDbConnection();
-  try {
-    await db.execute(
-      'INSERT INTO audit_logs (user_id, server_id, action, details) VALUES (?, ?, ?, ?)',
-      [userId, serverId, action, details || null]
-    );
-  } finally {
+  try {} finally {
     await db.end();
   }
killedBy: audit-log writes audit row and closes connection
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "INSERT INTO audit_logs (user_id, server_id, action, details) VALUES (?, ?, ?, ?)", ["u-1", "s-1", "test_action", "details text"]

Number of calls: 0

[Killed] StringLiteral
src/audit-log.ts:9:7
   const db = await getDbConnection();
   try {
     await db.execute(
-      'INSERT INTO audit_logs (user_id, server_id, action, details) VALUES (?, ?, ?, ?)',
+      "",
       [userId, serverId, action, details || null]
     );
killedBy: audit-log writes audit row and closes connection
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "INSERT INTO audit_logs (user_id, server_id, action, details) VALUES (?, ?, ?, ?)",
+ "",
  ["u-1", "s-1", "test_action", "details text"],

[Killed] ConditionalExpression
src/audit-log.ts:10:34
   try {
     await db.execute(
       'INSERT INTO audit_logs (user_id, server_id, action, details) VALUES (?, ?, ?, ?)',
-      [userId, serverId, action, details || null]
+      [userId, serverId, action, true]
     );
   } finally {
killedBy: audit-log writes audit row and closes connection
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "INSERT INTO audit_logs (user_id, server_id, action, details) VALUES (?, ?, ?, ?)",
  Array [
    "u-1",

[Killed] ConditionalExpression
src/audit-log.ts:10:34
   try {
     await db.execute(
       'INSERT INTO audit_logs (user_id, server_id, action, details) VALUES (?, ?, ?, ?)',
-      [userId, serverId, action, details || null]
+      [userId, serverId, action, false]
     );
   } finally {
killedBy: audit-log writes audit row and closes connection
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "INSERT INTO audit_logs (user_id, server_id, action, details) VALUES (?, ?, ?, ?)",
  Array [
    "u-1",

[Killed] BlockStatement
src/audit-log.ts:12:13
       'INSERT INTO audit_logs (user_id, server_id, action, details) VALUES (?, ?, ?, ?)',
       [userId, serverId, action, details || null]
     );
-  } finally {
-    await db.end();
-  }
+  } finally {}
 }
 
killedBy: audit-log writes audit row and closes connection
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
