[Timeout] BlockStatement
src/audit-log.ts:2:46
 // Stub for audit-log used in tests
-export function logOperation(...args: any[]) {
-  // If no arguments, log a unique message. This is intentional for mutation testing.
-  if (arguments.length === 0) {
-    // This string must be unique and not trivially mutated.
-    console.log('[AUDIT] (no arguments provided)');
-    return;
-  }
-  // If called with a single argument that is null or undefined, log as [null] or [undefined]
-  if (arguments.length === 1 && (args[0] === null || args[0] === undefined)) {
-    console.log('[AUDIT]', [args[0]]);
-    return;
-  }
-  // If called with a single argument that is an array, log as [AUDIT] (array) ...args[0]
-  if (arguments.length === 1 && Array.isArray(args[0])) {
-    console.log('[AUDIT] (array)', ...args[0]);
-    return;
-  }
-  // If called with a single argument (object, string, etc), log as [AUDIT], arg
-  if (arguments.length === 1) {
-    console.log('[AUDIT]', args[0]);
-    return;
-  }
-  // If called with multiple arguments, spread them
-  console.log('[AUDIT]', ...args);
-}
+export function logOperation(...args: any[]) {}
 

[Timeout] BlockStatement
src/audit-log.ts:4:31
 // Stub for audit-log used in tests
 export function logOperation(...args: any[]) {
   // If no arguments, log a unique message. This is intentional for mutation testing.
-  if (arguments.length === 0) {
-    // This string must be unique and not trivially mutated.
-    console.log('[AUDIT] (no arguments provided)');
-    return;
-  }
+  if (arguments.length === 0) {}
   // If called with a single argument that is null or undefined, log as [null] or [undefined]
   if (arguments.length === 1 && (args[0] === null || args[0] === undefined)) {

[Timeout] EqualityOperator
src/audit-log.ts:4:7
 // Stub for audit-log used in tests
 export function logOperation(...args: any[]) {
   // If no arguments, log a unique message. This is intentional for mutation testing.
-  if (arguments.length === 0) {
+  if (arguments.length !== 0) {
     // This string must be unique and not trivially mutated.
     console.log('[AUDIT] (no arguments provided)');

[Timeout] BlockStatement
src/audit-log.ts:10:78
     return;
   }
   // If called with a single argument that is null or undefined, log as [null] or [undefined]
-  if (arguments.length === 1 && (args[0] === null || args[0] === undefined)) {
-    console.log('[AUDIT]', [args[0]]);
-    return;
-  }
+  if (arguments.length === 1 && (args[0] === null || args[0] === undefined)) {}
   // If called with a single argument that is an array, log as [AUDIT] (array) ...args[0]
   if (arguments.length === 1 && Array.isArray(args[0])) {

[Timeout] ConditionalExpression
src/audit-log.ts:10:7
     return;
   }
   // If called with a single argument that is null or undefined, log as [null] or [undefined]
-  if (arguments.length === 1 && (args[0] === null || args[0] === undefined)) {
+  if (true) {
     console.log('[AUDIT]', [args[0]]);
     return;

[Timeout] StringLiteral
src/audit-log.ts:11:17
   }
   // If called with a single argument that is null or undefined, log as [null] or [undefined]
   if (arguments.length === 1 && (args[0] === null || args[0] === undefined)) {
-    console.log('[AUDIT]', [args[0]]);
+    console.log("", [args[0]]);
     return;
   }

[Timeout] BlockStatement
src/audit-log.ts:15:57
     return;
   }
   // If called with a single argument that is an array, log as [AUDIT] (array) ...args[0]
-  if (arguments.length === 1 && Array.isArray(args[0])) {
-    console.log('[AUDIT] (array)', ...args[0]);
-    return;
-  }
+  if (arguments.length === 1 && Array.isArray(args[0])) {}
   // If called with a single argument (object, string, etc), log as [AUDIT], arg
   if (arguments.length === 1) {

[Timeout] ConditionalExpression
src/audit-log.ts:15:7
     return;
   }
   // If called with a single argument that is an array, log as [AUDIT] (array) ...args[0]
-  if (arguments.length === 1 && Array.isArray(args[0])) {
+  if (true && Array.isArray(args[0])) {
     console.log('[AUDIT] (array)', ...args[0]);
     return;

[Timeout] ConditionalExpression
src/audit-log.ts:20:7
     return;
   }
   // If called with a single argument (object, string, etc), log as [AUDIT], arg
-  if (arguments.length === 1) {
+  if (true) {
     console.log('[AUDIT]', args[0]);
     return;

[Timeout] EqualityOperator
src/audit-log.ts:20:7
     return;
   }
   // If called with a single argument (object, string, etc), log as [AUDIT], arg
-  if (arguments.length === 1) {
+  if (arguments.length !== 1) {
     console.log('[AUDIT]', args[0]);
     return;
