[Killed] BlockStatement
src/games.ts:91:16
         pathSteps.push(direction);
         if (direction === 'L') {
             position = Math.max(0, position - 1);
-        } else {
-            position = Math.min(PLINKO_MULTIPLIERS.length - 1, position + 1);
-        }
+        } else {}
     }
 
killedBy: Games plinko stays within lane bounds for extreme left and right paths
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Landing slot: 11"
Received string:    "🔵 Plinko
Path: R -> R -> R -> R -> R -> R
Landing slot: 6
Payout: **5.0x**"

[Killed] MethodExpression
src/games.ts:92:24
         if (direction === 'L') {
             position = Math.max(0, position - 1);
         } else {
-            position = Math.min(PLINKO_MULTIPLIERS.length - 1, position + 1);
+            position = Math.max(PLINKO_MULTIPLIERS.length - 1, position + 1);
         }
     }
killedBy: Games game functions use default random source when omitted
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/games.ts:92:64
         if (direction === 'L') {
             position = Math.max(0, position - 1);
         } else {
-            position = Math.min(PLINKO_MULTIPLIERS.length - 1, position + 1);
+            position = Math.min(PLINKO_MULTIPLIERS.length - 1, position - 1);
         }
     }
killedBy: Games game functions use default random source when omitted
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/games.ts:97:18
     }
 
     const multiplier = PLINKO_MULTIPLIERS[position];
-    const lane = position + 1;
+    const lane = position - 1;
 
     return `🔵 Plinko\nPath: ${pathSteps.join(' -> ')}\nLanding slot: ${lane}\nPayout: **${multiplier.toFixed(1)}x**`;
killedBy: Games plinko stays within lane bounds for extreme left and right paths
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Landing slot: 1"
Received string:    "🔵 Plinko
Path: L -> L -> L -> L -> L -> L
Landing slot: -1
Payout: **0.4x**"

[Killed] BlockStatement
src/games.ts:102:71
     return `🔵 Plinko\nPath: ${pathSteps.join(' -> ')}\nLanding slot: ${lane}\nPayout: **${multiplier.toFixed(1)}x**`;
 }
 
-export function playMines(random: RandomSource = Math.random): string {
-    const minePositions = new Set<number>();
-    let attempts = 0;
-    while (minePositions.size < MINE_COUNT && attempts < 100) {
-        minePositions.add(pickIndex(MINE_TILES, random));
-        attempts += 1;
-    }
-    // Fallback: place remaining mines sequentially
-    for (let i = 0; minePositions.size < MINE_COUNT; i += 1) {
-        minePositions.add(i);
-    }
-
-    const pickedTile = pickIndex(MINE_TILES, random);
-    const safePick = !minePositions.has(pickedTile);
-    const safeTiles = MINE_TILES - MINE_COUNT;
-    // Stryker disable next-line StringLiteral: fallback value is unreachable because boom returns early.
-    const multiplier = safePick ? (1 + MINE_COUNT / safeTiles).toFixed(2) : '0.00';
-    const board = buildMinesBoard(minePositions, pickedTile);
-
-    if (!safePick) {
-        return `💣 Mines\nPick: tile ${pickedTile + 1}\n${board}\nResult: **Boom**`;
-    }
-
-    return `💣 Mines\nPick: tile ${pickedTile + 1}\n${board}\nResult: **Safe** at ${multiplier}x`;
-}
+export function playMines(random: RandomSource = Math.random): string {}
 
killedBy: Games game functions use default random source when omitted
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] EqualityOperator
src/games.ts:105:12
 export function playMines(random: RandomSource = Math.random): string {
     const minePositions = new Set<number>();
     let attempts = 0;
-    while (minePositions.size < MINE_COUNT && attempts < 100) {
+    while (minePositions.size <= MINE_COUNT && attempts < 100) {
         minePositions.add(pickIndex(MINE_TILES, random));
         attempts += 1;
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Safe** at 1.50x"
Received string:    "💣 Mines
Pick: tile 9
⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ 💥

[Killed] EqualityOperator
src/games.ts:105:47
 export function playMines(random: RandomSource = Math.random): string {
     const minePositions = new Set<number>();
     let attempts = 0;
-    while (minePositions.size < MINE_COUNT && attempts < 100) {
+    while (minePositions.size < MINE_COUNT && attempts >= 100) {
         minePositions.add(pickIndex(MINE_TILES, random));
         attempts += 1;
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Pick: tile 9"
Received string:    "💣 Mines
Pick: tile 1
💥 ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ ⬜

[Timeout] AssignmentOperator
src/games.ts:107:9
     let attempts = 0;
     while (minePositions.size < MINE_COUNT && attempts < 100) {
         minePositions.add(pickIndex(MINE_TILES, random));
-        attempts += 1;
+        attempts -= 1;
     }
     // Fallback: place remaining mines sequentially

[Killed] AssignmentOperator
src/games.ts:110:54
         attempts += 1;
     }
     // Fallback: place remaining mines sequentially
-    for (let i = 0; minePositions.size < MINE_COUNT; i += 1) {
+    for (let i = 0; minePositions.size < MINE_COUNT; i -= 1) {
         minePositions.add(i);
     }
killedBy: Games mines fallback adds expected mine tiles for tile 2 pick
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Boom**"
Received string:    "💣 Mines
Pick: tile 2
⬜ 💎 ⬜
⬜ ⬜ ⬜
⬜ ⬜ ⬜

[Killed] EqualityOperator
src/games.ts:110:21
         attempts += 1;
     }
     // Fallback: place remaining mines sequentially
-    for (let i = 0; minePositions.size < MINE_COUNT; i += 1) {
+    for (let i = 0; minePositions.size <= MINE_COUNT; i += 1) {
         minePositions.add(i);
     }
killedBy: Games mines does not add a fourth mine in fallback loop
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Safe** at 1.50x"
Received string:    "💣 Mines
Pick: tile 4
⬜ ⬜ ⬜
💥 ⬜ ⬜
⬜ ⬜ ⬜

[Killed] BooleanLiteral
src/games.ts:115:22
     }
 
     const pickedTile = pickIndex(MINE_TILES, random);
-    const safePick = !minePositions.has(pickedTile);
+    const safePick = minePositions.has(pickedTile);
     const safeTiles = MINE_TILES - MINE_COUNT;
     // Stryker disable next-line StringLiteral: fallback value is unreachable because boom returns early.
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Safe** at 1.50x"
Received string:    "💣 Mines
Pick: tile 9
⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ 💎

[Killed] ArithmeticOperator
src/games.ts:116:23
 
     const pickedTile = pickIndex(MINE_TILES, random);
     const safePick = !minePositions.has(pickedTile);
-    const safeTiles = MINE_TILES - MINE_COUNT;
+    const safeTiles = MINE_TILES + MINE_COUNT;
     // Stryker disable next-line StringLiteral: fallback value is unreachable because boom returns early.
     const multiplier = safePick ? (1 + MINE_COUNT / safeTiles).toFixed(2) : '0.00';
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Safe** at 1.50x"
Received string:    "💣 Mines
Pick: tile 9
⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ 💎

[Killed] ArithmeticOperator
src/games.ts:118:40
     const safePick = !minePositions.has(pickedTile);
     const safeTiles = MINE_TILES - MINE_COUNT;
     // Stryker disable next-line StringLiteral: fallback value is unreachable because boom returns early.
-    const multiplier = safePick ? (1 + MINE_COUNT / safeTiles).toFixed(2) : '0.00';
+    const multiplier = safePick ? (1 + MINE_COUNT * safeTiles).toFixed(2) : '0.00';
     const board = buildMinesBoard(minePositions, pickedTile);
 
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Safe** at 1.50x"
Received string:    "💣 Mines
Pick: tile 9
⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ 💎

[Killed] ArithmeticOperator
src/games.ts:118:36
     const safePick = !minePositions.has(pickedTile);
     const safeTiles = MINE_TILES - MINE_COUNT;
     // Stryker disable next-line StringLiteral: fallback value is unreachable because boom returns early.
-    const multiplier = safePick ? (1 + MINE_COUNT / safeTiles).toFixed(2) : '0.00';
+    const multiplier = safePick ? (1 - MINE_COUNT / safeTiles).toFixed(2) : '0.00';
     const board = buildMinesBoard(minePositions, pickedTile);
 
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Safe** at 1.50x"
Received string:    "💣 Mines
Pick: tile 9
⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ 💎

[Killed] BooleanLiteral
src/games.ts:121:9
     const multiplier = safePick ? (1 + MINE_COUNT / safeTiles).toFixed(2) : '0.00';
     const board = buildMinesBoard(minePositions, pickedTile);
 
-    if (!safePick) {
+    if (safePick) {
         return `💣 Mines\nPick: tile ${pickedTile + 1}\n${board}\nResult: **Boom**`;
     }
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Safe** at 1.50x"
Received string:    "💣 Mines
Pick: tile 9
⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ 💎

[Killed] ConditionalExpression
src/games.ts:121:9
     const multiplier = safePick ? (1 + MINE_COUNT / safeTiles).toFixed(2) : '0.00';
     const board = buildMinesBoard(minePositions, pickedTile);
 
-    if (!safePick) {
+    if (false) {
         return `💣 Mines\nPick: tile ${pickedTile + 1}\n${board}\nResult: **Boom**`;
     }
killedBy: Games mines boom path includes boom result
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Result: **Boom**"
Received string:    "💣 Mines
Pick: tile 1
💥 ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ ⬜

[Killed] ArithmeticOperator
src/games.ts:122:40
     const board = buildMinesBoard(minePositions, pickedTile);
 
     if (!safePick) {
-        return `💣 Mines\nPick: tile ${pickedTile + 1}\n${board}\nResult: **Boom**`;
+        return `💣 Mines\nPick: tile ${ppickedTile - 1\n${board}\nResult: **Boom**`;
     }
 
killedBy: Games mines boom path includes boom result
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Pick: tile 1"
Received string:    "💣 Mines
Pick: tile -1
💥 ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ ⬜

[Killed] ArithmeticOperator
src/games.ts:125:36
         return `💣 Mines\nPick: tile ${pickedTile + 1}\n${board}\nResult: **Boom**`;
     }
 
-    return `💣 Mines\nPick: tile ${pickedTile + 1}\n${board}\nResult: **Safe** at ${multiplier}x`;
+    return `💣 Mines\nPick: tile ${ppickedTile - 1\n${board}\nResult: **Safe** at ${multiplier}x`;
 }
 
killedBy: Games mines safe path includes multiplier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Pick: tile 9"
Received string:    "💣 Mines
Pick: tile 7
⬜ ⬜ ⬜
⬜ ⬜ ⬜
⬜ ⬜ 💎

[Killed] StringLiteral
src/games.ts:125:12
         return `💣 Mines\nPick: tile ${pickedTile + 1}\n${board}\nResult: **Boom**`;
     }
 
-    return `💣 Mines\nPick: tile ${pickedTile + 1}\n${board}\nResult: **Safe** at ${multiplier}x`;
+    return ``
 }
 
killedBy: Games mines returns a bounded pick and a result
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Mines"
Received string:    ""
