[Survived] ArrayDeclaration
src/backend/security/anomaly-detection.ts:9:29
 const { forwardToSIEM } = require('../siem');
 const { triggerPlaybook } = require('../incident-response');
 
-const SUSPICIOUS_PATTERNS = [
-  /sleep\s*\(/i, // time-based injection
-  /union\s+select/i,
-  /or\s+1=1/i,
-  /drop\s+table/i,
-  /--/,
-  /\/\*/,
-  /information_schema/i,
-  /benchmark\s*\(/i
-];
+const SUSPICIOUS_PATTERNS = [];
 
 export function detectAnomaly(query: string, params: any[] | null | undefined, context: { userId?: string, ip?: string }) {

[Survived] Regex
src/backend/security/anomaly-detection.ts:10:3
 const { triggerPlaybook } = require('../incident-response');
 
 const SUSPICIOUS_PATTERNS = [
-  /sleep\s*\(/i, // time-based injection
+  /sleep\S*\(/i, // time-based injection
   /union\s+select/i,
   /or\s+1=1/i,

[Survived] Regex
src/backend/security/anomaly-detection.ts:11:3
 
 const SUSPICIOUS_PATTERNS = [
   /sleep\s*\(/i, // time-based injection
-  /union\s+select/i,
+  /union\sselect/i,
   /or\s+1=1/i,
   /drop\s+table/i,

[Survived] Regex
src/backend/security/anomaly-detection.ts:12:3
 const SUSPICIOUS_PATTERNS = [
   /sleep\s*\(/i, // time-based injection
   /union\s+select/i,
-  /or\s+1=1/i,
+  /or\s1=1/i,
   /drop\s+table/i,
   /--/,

[Survived] BooleanLiteral
src/backend/security/anomaly-detection.ts:22:17
 
 export function detectAnomaly(query: string, params: any[] | null | undefined, context: { userId?: string, ip?: string }) {
   const safeParams = Array.isArray(params) ? params : [];
-  let flagged = false;
+  let flagged = true;
   for (const pattern of SUSPICIOUS_PATTERNS) {
     if (pattern.test(query)) {

[Survived] BlockStatement
src/backend/security/anomaly-detection.ts:23:46
 export function detectAnomaly(query: string, params: any[] | null | undefined, context: { userId?: string, ip?: string }) {
   const safeParams = Array.isArray(params) ? params : [];
   let flagged = false;
-  for (const pattern of SUSPICIOUS_PATTERNS) {
-    if (pattern.test(query)) {
-      flagged = true;
-      break;
-    }
-  }
+  for (const pattern of SUSPICIOUS_PATTERNS) {}
   if (flagged || safeParams.length > 10) {
     const event = {

[Survived] ConditionalExpression
src/backend/security/anomaly-detection.ts:24:9
   const safeParams = Array.isArray(params) ? params : [];
   let flagged = false;
   for (const pattern of SUSPICIOUS_PATTERNS) {
-    if (pattern.test(query)) {
+    if (true) {
       flagged = true;
       break;

[Survived] BlockStatement
src/backend/security/anomaly-detection.ts:24:30
   const safeParams = Array.isArray(params) ? params : [];
   let flagged = false;
   for (const pattern of SUSPICIOUS_PATTERNS) {
-    if (pattern.test(query)) {
-      flagged = true;
-      break;
-    }
+    if (pattern.test(query)) {}
   }
   if (flagged || safeParams.length > 10) {

[Survived] BooleanLiteral
src/backend/security/anomaly-detection.ts:25:17
   let flagged = false;
   for (const pattern of SUSPICIOUS_PATTERNS) {
     if (pattern.test(query)) {
-      flagged = true;
+      flagged = false;
       break;
     }

[Survived] ConditionalExpression
src/backend/security/anomaly-detection.ts:29:18
       break;
     }
   }
-  if (flagged || safeParams.length > 10) {
+  if (flagged || false) {
     const event = {
       action: 'anomaly_detected',

[Survived] EqualityOperator
src/backend/security/anomaly-detection.ts:29:18
       break;
     }
   }
-  if (flagged || safeParams.length > 10) {
+  if (flagged || safeParams.length >= 10) {
     const event = {
       action: 'anomaly_detected',

[Survived] StringLiteral
src/backend/security/anomaly-detection.ts:31:15
   }
   if (flagged || safeParams.length > 10) {
     const event = {
-      action: 'anomaly_detected',
+      action: "",
       query,
       params: safeParams,
