[Killed] BlockStatement
src/analytics.ts:5:46
 // This module will aggregate and provide analytics for admins
 import { getDbConnection } from './db';
 
-export async function getPlatformAnalytics() {
-  const db = await getDbConnection();
-  const [userRows] = await db.execute('SELECT COUNT(DISTINCT user) as count FROM leaderboard');
-  const [codeRows] = await db.execute('SELECT COUNT(*) as count FROM codes');
-  const [affiliateRows] = await db.execute('SELECT COUNT(DISTINCT user_id) as count FROM audit_logs WHERE action = "send_affiliate_link"');
-  const [rewardRows] = await db.execute('SELECT SUM(score) as total FROM leaderboard');
-  const userCount = (userRows as any[])[0];
-  const codeCount = (codeRows as any[])[0];
-  const affiliateCount = (affiliateRows as any[])[0];
-  const totalRewards = (rewardRows as any[])[0];
-  return {
-    userCount: userCount.count,
-    codeCount: codeCount.count,
-    affiliateCount: affiliateCount.count,
-    totalRewards: totalRewards.total
-  };
-}
+export async function getPlatformAnalytics() {}
 
killedBy: platform utility modules getPlatformAnalytics aggregates db counts correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"affiliateCount": 4, "codeCount": 7, "totalRewards": 530, "userCount": 12}
Received: undefined

[Killed] StringLiteral
src/analytics.ts:7:39
 
 export async function getPlatformAnalytics() {
   const db = await getDbConnection();
-  const [userRows] = await db.execute('SELECT COUNT(DISTINCT user) as count FROM leaderboard');
+  const [userRows] = await db.execute("");
   const [codeRows] = await db.execute('SELECT COUNT(*) as count FROM codes');
   const [affiliateRows] = await db.execute('SELECT COUNT(DISTINCT user_id) as count FROM audit_logs WHERE action = "send_affiliate_link"');
killedBy: platform utility modules getPlatformAnalytics aggregates db counts correctly
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "SELECT COUNT(DISTINCT user) as count FROM leaderboard"
Received
->     1: ""
       2: "SELECT COUNT(*) as count FROM codes"

[Killed] StringLiteral
src/analytics.ts:8:39
 export async function getPlatformAnalytics() {
   const db = await getDbConnection();
   const [userRows] = await db.execute('SELECT COUNT(DISTINCT user) as count FROM leaderboard');
-  const [codeRows] = await db.execute('SELECT COUNT(*) as count FROM codes');
+  const [codeRows] = await db.execute("");
   const [affiliateRows] = await db.execute('SELECT COUNT(DISTINCT user_id) as count FROM audit_logs WHERE action = "send_affiliate_link"');
   const [rewardRows] = await db.execute('SELECT SUM(score) as total FROM leaderboard');
killedBy: platform utility modules getPlatformAnalytics aggregates db counts correctly
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: "SELECT COUNT(*) as count FROM codes"
Received
       1: "SELECT COUNT(DISTINCT user) as count FROM leaderboard"
->     2: ""
       3: "SELECT COUNT(DISTINCT user_id) as count FROM audit_logs WHERE action = \"send_affiliate_link\""

[Killed] StringLiteral
src/analytics.ts:10:41
   const [userRows] = await db.execute('SELECT COUNT(DISTINCT user) as count FROM leaderboard');
   const [codeRows] = await db.execute('SELECT COUNT(*) as count FROM codes');
   const [affiliateRows] = await db.execute('SELECT COUNT(DISTINCT user_id) as count FROM audit_logs WHERE action = "send_affiliate_link"');
-  const [rewardRows] = await db.execute('SELECT SUM(score) as total FROM leaderboard');
+  const [rewardRows] = await db.execute("");
   const userCount = (userRows as any[])[0];
   const codeCount = (codeRows as any[])[0];
killedBy: platform utility modules getPlatformAnalytics aggregates db counts correctly
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 4
Expected: "SELECT SUM(score) as total FROM leaderboard"
Received
       3: "SELECT COUNT(DISTINCT user_id) as count FROM audit_logs WHERE action = \"send_affiliate_link\""
->     4: ""
