[Survived] BlockStatement
src/backend/security/sanitize.ts:5:53
 // Prevents XSS, SQLi, and injection attacks
 import xss from 'xss';
 
-export function sanitizeString(str: string): string {
-  return xss(str.trim());
-}
+export function sanitizeString(str: string): string {}
 
 export function sanitizeNumber(n: any): number {

[Survived] MethodExpression
src/backend/security/sanitize.ts:6:14
 import xss from 'xss';
 
 export function sanitizeString(str: string): string {
-  return xss(str.trim());
+  return xss(str);
 }
 

[Survived] BlockStatement
src/backend/security/sanitize.ts:9:48
   return xss(str.trim());
 }
 
-export function sanitizeNumber(n: any): number {
-  const num = Number(n);
-  if (isNaN(num)) throw new Error('Invalid number input');
-  return num;
-}
+export function sanitizeNumber(n: any): number {}
 
 export function sanitizeObject(obj: Record<string, any>): Record<string, any> {

[Survived] ConditionalExpression
src/backend/security/sanitize.ts:11:7
 
 export function sanitizeNumber(n: any): number {
   const num = Number(n);
-  if (isNaN(num)) throw new Error('Invalid number input');
+  if (true) throw new Error('Invalid number input');
   return num;
 }

[Survived] ConditionalExpression
src/backend/security/sanitize.ts:11:7
 
 export function sanitizeNumber(n: any): number {
   const num = Number(n);
-  if (isNaN(num)) throw new Error('Invalid number input');
+  if (false) throw new Error('Invalid number input');
   return num;
 }

[Survived] BlockStatement
src/backend/security/sanitize.ts:15:79
   return num;
 }
 
-export function sanitizeObject(obj: Record<string, any>): Record<string, any> {
-  const sanitized: Record<string, any> = {};
-  for (const key in obj) {
-    if (typeof obj[key] === 'string') {
-      // Try to convert to number if possible
-      const num = Number(obj[key]);
-      if (!isNaN(num) && obj[key].trim() !== '') {
-        sanitized[key] = sanitizeNumber(obj[key]);
-      } else {
-        sanitized[key] = sanitizeString(obj[key]);
-      }
-    } else if (typeof obj[key] === 'number') {
-      sanitized[key] = sanitizeNumber(obj[key]);
-    } else {
-      sanitized[key] = obj[key];
-    }
-  }
-  return sanitized;
-}
+export function sanitizeObject(obj: Record<string, any>): Record<string, any> {}
 

[Survived] BlockStatement
src/backend/security/sanitize.ts:17:26
 
 export function sanitizeObject(obj: Record<string, any>): Record<string, any> {
   const sanitized: Record<string, any> = {};
-  for (const key in obj) {
-    if (typeof obj[key] === 'string') {
-      // Try to convert to number if possible
-      const num = Number(obj[key]);
-      if (!isNaN(num) && obj[key].trim() !== '') {
-        sanitized[key] = sanitizeNumber(obj[key]);
-      } else {
-        sanitized[key] = sanitizeString(obj[key]);
-      }
-    } else if (typeof obj[key] === 'number') {
-      sanitized[key] = sanitizeNumber(obj[key]);
-    } else {
-      sanitized[key] = obj[key];
-    }
-  }
+  for (const key in obj) {}
   return sanitized;
 }

[Survived] BlockStatement
src/backend/security/sanitize.ts:18:39
 export function sanitizeObject(obj: Record<string, any>): Record<string, any> {
   const sanitized: Record<string, any> = {};
   for (const key in obj) {
-    if (typeof obj[key] === 'string') {
-      // Try to convert to number if possible
-      const num = Number(obj[key]);
-      if (!isNaN(num) && obj[key].trim() !== '') {
-        sanitized[key] = sanitizeNumber(obj[key]);
-      } else {
-        sanitized[key] = sanitizeString(obj[key]);
-      }
-    } else if (typeof obj[key] === 'number') {
+    if (typeof obj[key] === 'string') {} else if (typeof obj[key] === 'number') {
       sanitized[key] = sanitizeNumber(obj[key]);
     } else {

[Survived] ConditionalExpression
src/backend/security/sanitize.ts:18:9
 export function sanitizeObject(obj: Record<string, any>): Record<string, any> {
   const sanitized: Record<string, any> = {};
   for (const key in obj) {
-    if (typeof obj[key] === 'string') {
+    if (true) {
       // Try to convert to number if possible
       const num = Number(obj[key]);

[Survived] LogicalOperator
src/backend/security/sanitize.ts:21:11
     if (typeof obj[key] === 'string') {
       // Try to convert to number if possible
       const num = Number(obj[key]);
-      if (!isNaN(num) && obj[key].trim() !== '') {
+      if (!isNaN(num) || obj[key].trim() !== '') {
         sanitized[key] = sanitizeNumber(obj[key]);
       } else {

[Survived] ConditionalExpression
src/backend/security/sanitize.ts:21:11
     if (typeof obj[key] === 'string') {
       // Try to convert to number if possible
       const num = Number(obj[key]);
-      if (!isNaN(num) && obj[key].trim() !== '') {
+      if (true) {
         sanitized[key] = sanitizeNumber(obj[key]);
       } else {

[Survived] BlockStatement
src/backend/security/sanitize.ts:23:14
       const num = Number(obj[key]);
       if (!isNaN(num) && obj[key].trim() !== '') {
         sanitized[key] = sanitizeNumber(obj[key]);
-      } else {
-        sanitized[key] = sanitizeString(obj[key]);
-      }
+      } else {}
     } else if (typeof obj[key] === 'number') {
       sanitized[key] = sanitizeNumber(obj[key]);

[Survived] ConditionalExpression
src/backend/security/sanitize.ts:26:16
       } else {
         sanitized[key] = sanitizeString(obj[key]);
       }
-    } else if (typeof obj[key] === 'number') {
+    } else if (true) {
       sanitized[key] = sanitizeNumber(obj[key]);
     } else {

[Survived] BlockStatement
src/backend/security/sanitize.ts:26:46
       } else {
         sanitized[key] = sanitizeString(obj[key]);
       }
-    } else if (typeof obj[key] === 'number') {
-      sanitized[key] = sanitizeNumber(obj[key]);
-    } else {
+    } else if (typeof obj[key] === 'number') {} else {
       sanitized[key] = obj[key];
     }

[Survived] BlockStatement
src/backend/security/sanitize.ts:28:12
       }
     } else if (typeof obj[key] === 'number') {
       sanitized[key] = sanitizeNumber(obj[key]);
-    } else {
-      sanitized[key] = obj[key];
-    }
+    } else {}
   }
   return sanitized;
