[Killed] BlockStatement
src/antifraud.ts:4:82
 // Anti-fraud and compliance monitoring
 import { getDbConnection } from './db';
 
-export async function checkFraudulentActivity(userId: string): Promise<string[]> {
-  const db = await getDbConnection();
-  const alerts: string[] = [];
-
-  // Example: Too many referrals in a short time
-  const [refRows]: [any[], any] = await db.execute(
-    `SELECT COUNT(*) as count FROM audit_logs WHERE user_id = ? AND action = 'send_affiliate_link' AND created_at > NOW() - INTERVAL 1 HOUR`,
-    [userId]
-  );
-  if (refRows[0]?.count > 5) {
-    alerts.push('High referral activity detected (possible abuse)');
-  }
-
-  // Example: Too many codes generated
-  const [codeRows]: [any[], any] = await db.execute(
-    `SELECT COUNT(*) as count FROM audit_logs WHERE user_id = ? AND action = 'generate_self_code' AND created_at > NOW() - INTERVAL 1 HOUR`,
-    [userId]
-  );
-  if (codeRows[0]?.count > 10) {
-    alerts.push('Excessive code generation detected');
-  }
-
-  return alerts;
-}
+export async function checkFraudulentActivity(userId: string): Promise<string[]> {}
 
killedBy: platform utility modules checkFraudulentActivity returns no alerts for low activity
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] StringLiteral
src/antifraud.ts:10:5
 
   // Example: Too many referrals in a short time
   const [refRows]: [any[], any] = await db.execute(
-    `SELECT COUNT(*) as count FROM audit_logs WHERE user_id = ? AND action = 'send_affiliate_link' AND created_at > NOW() - INTERVAL 1 HOUR`,
+    ``,
     [userId]
   );
killedBy: platform utility modules checkFraudulentActivity returns no alerts for low activity
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "SELECT COUNT(*) as count FROM audit_logs WHERE user_id = ? AND action = 'send_affiliate_link' AND created_at > NOW() - INTERVAL 1 HOUR", ["user-low"]
Received
->     1
          "",
          ["user-low"],

[Killed] EqualityOperator
src/antifraud.ts:13:7
     `SELECT COUNT(*) as count FROM audit_logs WHERE user_id = ? AND action = 'send_affiliate_link' AND created_at > NOW() - INTERVAL 1 HOUR`,
     [userId]
   );
-  if (refRows[0]?.count > 5) {
+  if (refRows[0]?.count <= 5) {
     alerts.push('High referral activity detected (possible abuse)');
   }
killedBy: platform utility modules checkFraudulentActivity returns no alerts for low activity
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "High referral activity detected (possible abuse)",

[Killed] EqualityOperator
src/antifraud.ts:13:7
     `SELECT COUNT(*) as count FROM audit_logs WHERE user_id = ? AND action = 'send_affiliate_link' AND created_at > NOW() - INTERVAL 1 HOUR`,
     [userId]
   );
-  if (refRows[0]?.count > 5) {
+  if (refRows[0]?.count >= 5) {
     alerts.push('High referral activity detected (possible abuse)');
   }
killedBy: platform utility modules checkFraudulentActivity does not alert at exact threshold values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "High referral activity detected (possible abuse)",

[Killed] StringLiteral
src/antifraud.ts:14:17
     [userId]
   );
   if (refRows[0]?.count > 5) {
-    alerts.push('High referral activity detected (possible abuse)');
+    alerts.push("");
   }
 
killedBy: platform utility modules checkFraudulentActivity returns both alerts for high activity
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "High referral activity detected (possible abuse)",
+   "",

[Killed] BlockStatement
src/antifraud.ts:22:32
     `SELECT COUNT(*) as count FROM audit_logs WHERE user_id = ? AND action = 'generate_self_code' AND created_at > NOW() - INTERVAL 1 HOUR`,
     [userId]
   );
-  if (codeRows[0]?.count > 10) {
-    alerts.push('Excessive code generation detected');
-  }
+  if (codeRows[0]?.count > 10) {}
 
   return alerts;
killedBy: platform utility modules checkFraudulentActivity returns both alerts for high activity
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    "High referral activity detected (possible abuse)",
-   "Excessive code generation detected",

[Killed] EqualityOperator
src/antifraud.ts:22:7
     `SELECT COUNT(*) as count FROM audit_logs WHERE user_id = ? AND action = 'generate_self_code' AND created_at > NOW() - INTERVAL 1 HOUR`,
     [userId]
   );
-  if (codeRows[0]?.count > 10) {
+  if (codeRows[0]?.count >= 10) {
     alerts.push('Excessive code generation detected');
   }
killedBy: platform utility modules checkFraudulentActivity does not alert at exact threshold values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Excessive code generation detected",
