[Survived] BooleanLiteral
src/backend/server.ts:13:15
 
 // Fastify instance must be created before registering plugins
 const fastify = Fastify({
-  trustProxy: true, // Enable trust proxy for correct client IP detection (rate limiting)
+  trustProxy: false, // Enable trust proxy for correct client IP detection (rate limiting)
   logger: {
     level: 'info',

[Survived] ObjectLiteral
src/backend/server.ts:14:11
 // Fastify instance must be created before registering plugins
 const fastify = Fastify({
   trustProxy: true, // Enable trust proxy for correct client IP detection (rate limiting)
-  logger: {
-    level: 'info',
-    serializers: {
-      req (request) {
-        return {
-          method: request.method,
-          url: request.url,
-          id: request.id,
-          remoteAddress: request.ip,
-        };
-      }
-    }
-  }
+  logger: {}
 });
 

[Survived] BlockStatement
src/backend/server.ts:17:21
   logger: {
     level: 'info',
     serializers: {
-      req (request) {
-        return {
-          method: request.method,
-          url: request.url,
-          id: request.id,
-          remoteAddress: request.ip,
-        };
-      }
+      req (request) {}
     }
   }

[Survived] BlockStatement
src/backend/server.ts:30:46
 });
 
 // Health and readiness endpoint for observability
-fastify.get('/health', async (req, reply) => {
-  return { status: 'ok', uptime: process.uptime() };
-});
+fastify.get('/health', async (req, reply) => {});
 
 // Cyber security: Advanced CORS policy

[Survived] StringLiteral
src/backend/server.ts:30:13
 });
 
 // Health and readiness endpoint for observability
-fastify.get('/health', async (req, reply) => {
+fastify.get("", async (req, reply) => {
   return { status: 'ok', uptime: process.uptime() };
 });

[Survived] ArrayDeclaration
src/backend/server.ts:36:11
 
 // Cyber security: Advanced CORS policy
 fastify.register(cors, {
-  origin: [
-    'https://your-production-domain.com',
-    'https://admin.your-production-domain.com',
-    'http://localhost:3000'
-  ],
+  origin: [],
   methods: ['GET', 'POST', 'PUT', 'DELETE', 'OPTIONS'],
   allowedHeaders: [

[Survived] ArrayDeclaration
src/backend/server.ts:41:12
     'https://admin.your-production-domain.com',
     'http://localhost:3000'
   ],
-  methods: ['GET', 'POST', 'PUT', 'DELETE', 'OPTIONS'],
+  methods: [],
   allowedHeaders: [
     'Content-Type',

[Survived] ArrayDeclaration
src/backend/server.ts:42:19
     'http://localhost:3000'
   ],
   methods: ['GET', 'POST', 'PUT', 'DELETE', 'OPTIONS'],
-  allowedHeaders: [
-    'Content-Type',
-    'Authorization',
-    'X-Requested-With',
-    'Accept',
-    'Origin'
-  ],
+  allowedHeaders: [],
   credentials: true,
   maxAge: 86400,

[Survived] StringLiteral
src/backend/server.ts:45:5
   allowedHeaders: [
     'Content-Type',
     'Authorization',
-    'X-Requested-With',
+    "",
     'Accept',
     'Origin'

[Survived] BooleanLiteral
src/backend/server.ts:49:16
     'Accept',
     'Origin'
   ],
-  credentials: true,
+  credentials: false,
   maxAge: 86400,
   strictPreflight: true,

[Survived] BooleanLiteral
src/backend/server.ts:51:20
   ],
   credentials: true,
   maxAge: 86400,
-  strictPreflight: true,
+  strictPreflight: false,
   preflightContinue: false,
   // Defensive: block if method or origin missing in preflight

[Survived] BooleanLiteral
src/backend/server.ts:52:22
   credentials: true,
   maxAge: 86400,
   strictPreflight: true,
-  preflightContinue: false,
+  preflightContinue: true,
   // Defensive: block if method or origin missing in preflight
   hook: 'onRequest',

[Survived] StringLiteral
src/backend/server.ts:54:9
   strictPreflight: true,
   preflightContinue: false,
   // Defensive: block if method or origin missing in preflight
-  hook: 'onRequest',
+  hook: "",
   preflight: true,
   async preHandler(req, reply) {

[Survived] BooleanLiteral
src/backend/server.ts:55:14
   preflightContinue: false,
   // Defensive: block if method or origin missing in preflight
   hook: 'onRequest',
-  preflight: true,
+  preflight: false,
   async preHandler(req, reply) {
     if (req.method === 'OPTIONS') {

[Survived] BlockStatement
src/backend/server.ts:56:32
   // Defensive: block if method or origin missing in preflight
   hook: 'onRequest',
   preflight: true,
-  async preHandler(req, reply) {
-    if (req.method === 'OPTIONS') {
-      const origin = req.headers['origin'];
-      const acrm = req.headers['access-control-request-method'];
-      if (!origin || !acrm) {
-        reply.code(400).send({ error: 'Missing required CORS preflight headers' });
-        return reply;
-      }
-    }
-  }
+  async preHandler(req, reply) {}
 });
 

[Survived] ConditionalExpression
src/backend/server.ts:57:9
   hook: 'onRequest',
   preflight: true,
   async preHandler(req, reply) {
-    if (req.method === 'OPTIONS') {
+    if (false) {
       const origin = req.headers['origin'];
       const acrm = req.headers['access-control-request-method'];

[Survived] BlockStatement
src/backend/server.ts:57:35
   hook: 'onRequest',
   preflight: true,
   async preHandler(req, reply) {
-    if (req.method === 'OPTIONS') {
-      const origin = req.headers['origin'];
-      const acrm = req.headers['access-control-request-method'];
-      if (!origin || !acrm) {
-        reply.code(400).send({ error: 'Missing required CORS preflight headers' });
-        return reply;
-      }
-    }
+    if (req.method === 'OPTIONS') {}
   }
 });

[Survived] StringLiteral
src/backend/server.ts:58:34
   preflight: true,
   async preHandler(req, reply) {
     if (req.method === 'OPTIONS') {
-      const origin = req.headers['origin'];
+      const origin = req.headers[""];
       const acrm = req.headers['access-control-request-method'];
       if (!origin || !acrm) {

[Survived] BlockStatement
src/backend/server.ts:60:29
     if (req.method === 'OPTIONS') {
       const origin = req.headers['origin'];
       const acrm = req.headers['access-control-request-method'];
-      if (!origin || !acrm) {
-        reply.code(400).send({ error: 'Missing required CORS preflight headers' });
-        return reply;
-      }
+      if (!origin || !acrm) {}
     }
   }

[Survived] ConditionalExpression
src/backend/server.ts:60:11
     if (req.method === 'OPTIONS') {
       const origin = req.headers['origin'];
       const acrm = req.headers['access-control-request-method'];
-      if (!origin || !acrm) {
+      if (true) {
         reply.code(400).send({ error: 'Missing required CORS preflight headers' });
         return reply;

[Survived] BooleanLiteral
src/backend/server.ts:72:11
 
 // Cyber security: HTTP headers hardening (strictest settings)
 fastify.register(helmet, {
-  global: true,
+  global: false,
   contentSecurityPolicy: {
     directives: {

[Survived] ObjectLiteral
src/backend/server.ts:74:17
 fastify.register(helmet, {
   global: true,
   contentSecurityPolicy: {
-    directives: {
-      defaultSrc: ["'self'"],
-      scriptSrc: ["'self'"],
-      styleSrc: ["'self'"],
-      imgSrc: ["'self'", 'data:'],
-      objectSrc: ["'none'"],
-      frameAncestors: ["'self'"],
-      formAction: ["'self'"],
-      baseUri: ["'self'"],
-      fontSrc: ["'self'", 'https:', 'data:'],
-      upgradeInsecureRequests: []
-    }
+    directives: {}
   },
   referrerPolicy: { policy: 'no-referrer' },

[Survived] StringLiteral
src/backend/server.ts:75:20
   global: true,
   contentSecurityPolicy: {
     directives: {
-      defaultSrc: ["'self'"],
+      defaultSrc: [""],
       scriptSrc: ["'self'"],
       styleSrc: ["'self'"],

[Survived] ArrayDeclaration
src/backend/server.ts:76:18
   contentSecurityPolicy: {
     directives: {
       defaultSrc: ["'self'"],
-      scriptSrc: ["'self'"],
+      scriptSrc: [],
       styleSrc: ["'self'"],
       imgSrc: ["'self'", 'data:'],

[Survived] StringLiteral
src/backend/server.ts:76:19
   contentSecurityPolicy: {
     directives: {
       defaultSrc: ["'self'"],
-      scriptSrc: ["'self'"],
+      scriptSrc: [""],
       styleSrc: ["'self'"],
       imgSrc: ["'self'", 'data:'],

[Survived] StringLiteral
src/backend/server.ts:80:24
       styleSrc: ["'self'"],
       imgSrc: ["'self'", 'data:'],
       objectSrc: ["'none'"],
-      frameAncestors: ["'self'"],
+      frameAncestors: [""],
       formAction: ["'self'"],
       baseUri: ["'self'"],

[Survived] StringLiteral
src/backend/server.ts:83:37
       frameAncestors: ["'self'"],
       formAction: ["'self'"],
       baseUri: ["'self'"],
-      fontSrc: ["'self'", 'https:', 'data:'],
+      fontSrc: ["'self'", 'https:', ""],
       upgradeInsecureRequests: []
     }

[Survived] ArrayDeclaration
src/backend/server.ts:83:16
       frameAncestors: ["'self'"],
       formAction: ["'self'"],
       baseUri: ["'self'"],
-      fontSrc: ["'self'", 'https:', 'data:'],
+      fontSrc: [],
       upgradeInsecureRequests: []
     }

[Survived] ObjectLiteral
src/backend/server.ts:88:30
     }
   },
   referrerPolicy: { policy: 'no-referrer' },
-  crossOriginResourcePolicy: { policy: 'same-origin' },
+  crossOriginResourcePolicy: {},
   crossOriginOpenerPolicy: { policy: 'same-origin' },
   xssFilter: false, // legacy, not needed

[Survived] BooleanLiteral
src/backend/server.ts:90:14
   referrerPolicy: { policy: 'no-referrer' },
   crossOriginResourcePolicy: { policy: 'same-origin' },
   crossOriginOpenerPolicy: { policy: 'same-origin' },
-  xssFilter: false, // legacy, not needed
+  xssFilter: true, // legacy, not needed
   xDownloadOptions: false, // legacy, not needed
   xPermittedCrossDomainPolicies: { permittedPolicies: 'none' },

[Survived] BooleanLiteral
src/backend/server.ts:91:21
   crossOriginResourcePolicy: { policy: 'same-origin' },
   crossOriginOpenerPolicy: { policy: 'same-origin' },
   xssFilter: false, // legacy, not needed
-  xDownloadOptions: false, // legacy, not needed
+  xDownloadOptions: true, // legacy, not needed
   xPermittedCrossDomainPolicies: { permittedPolicies: 'none' },
   hidePoweredBy: true,

[Survived] StringLiteral
src/backend/server.ts:92:55
   crossOriginOpenerPolicy: { policy: 'same-origin' },
   xssFilter: false, // legacy, not needed
   xDownloadOptions: false, // legacy, not needed
-  xPermittedCrossDomainPolicies: { permittedPolicies: 'none' },
+  xPermittedCrossDomainPolicies: { permittedPolicies: "" },
   hidePoweredBy: true,
   dnsPrefetchControl: { allow: false },

[Survived] BooleanLiteral
src/backend/server.ts:93:18
   xssFilter: false, // legacy, not needed
   xDownloadOptions: false, // legacy, not needed
   xPermittedCrossDomainPolicies: { permittedPolicies: 'none' },
-  hidePoweredBy: true,
+  hidePoweredBy: false,
   dnsPrefetchControl: { allow: false },
   frameguard: { action: 'deny' },

[Survived] BooleanLiteral
src/backend/server.ts:94:32
   xDownloadOptions: false, // legacy, not needed
   xPermittedCrossDomainPolicies: { permittedPolicies: 'none' },
   hidePoweredBy: true,
-  dnsPrefetchControl: { allow: false },
+  dnsPrefetchControl: { allow: true },
   frameguard: { action: 'deny' },
   // Add more strict headers as needed

[Survived] ObjectLiteral
src/backend/server.ts:94:23
   xDownloadOptions: false, // legacy, not needed
   xPermittedCrossDomainPolicies: { permittedPolicies: 'none' },
   hidePoweredBy: true,
-  dnsPrefetchControl: { allow: false },
+  dnsPrefetchControl: {},
   frameguard: { action: 'deny' },
   // Add more strict headers as needed

[Survived] ObjectLiteral
src/backend/server.ts:95:15
   xPermittedCrossDomainPolicies: { permittedPolicies: 'none' },
   hidePoweredBy: true,
   dnsPrefetchControl: { allow: false },
-  frameguard: { action: 'deny' },
+  frameguard: {},
   // Add more strict headers as needed
 });

[Survived] EqualityOperator
src/backend/server.ts:101:16
 
 // Cyber security: Rate limiting
 // Only allow 127.0.0.1 in allowList for local dev, not for tests
-const isTest = process.env.NODE_ENV === 'test' || process.env.JEST_WORKER_ID !== undefined;
+const isTest = process.env.NODE_ENV !== 'test' || process.env.JEST_WORKER_ID !== undefined;
 fastify.register(rateLimit, {
   max: 100,

[Survived] ConditionalExpression
src/backend/server.ts:101:16
 
 // Cyber security: Rate limiting
 // Only allow 127.0.0.1 in allowList for local dev, not for tests
-const isTest = process.env.NODE_ENV === 'test' || process.env.JEST_WORKER_ID !== undefined;
+const isTest = false;
 fastify.register(rateLimit, {
   max: 100,

[Survived] ArrayDeclaration
src/backend/server.ts:105:28
 fastify.register(rateLimit, {
   max: 100,
   timeWindow: '1 minute',
-  allowList: isTest ? [] : ['127.0.0.1']
+  allowList: isTest ? [] : []
 });
 

[Survived] BlockStatement
src/backend/server.ts:113:48
 tradeRoutes(fastify);
 
 
-export async function startServer(port = 4000) {
-  return fastify.listen({ port });
-}
+export async function startServer(port = 4000) {}
 
 if (require.main === module) {

[Survived] ObjectLiteral
src/backend/server.ts:114:25
 
 
 export async function startServer(port = 4000) {
-  return fastify.listen({ port });
+  return fastify.listen({});
 }
 
