[Killed] BlockStatement
src/chart.ts:4:108
 // Chart generation using QuickChart API
 import fetch from 'node-fetch';
 
-export async function getChartUrl(data: number[], labels: string[], title = 'Game Stats'): Promise<string> {
-  const chartConfig = {
-    type: 'bar',
-    data: {
-      labels,
-      datasets: [{ label: title, data }]
-    }
-  };
-  const url = `https://quickchart.io/chart?c=${encodeURIComponent(JSON.stringify(chartConfig))}`;
-  return url;
-}
+export async function getChartUrl(data: number[], labels: string[], title = 'Game Stats'): Promise<string> {}
 
killedBy: platform utility modules getChartUrl returns encoded quickchart URL
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Killed] StringLiteral
src/chart.ts:4:77
 // Chart generation using QuickChart API
 import fetch from 'node-fetch';
 
-export async function getChartUrl(data: number[], labels: string[], title = 'Game Stats'): Promise<string> {
+export async function getChartUrl(data: number[], labels: string[], title = ""): Promise<string> {
   const chartConfig = {
     type: 'bar',
killedBy: platform utility modules getChartUrl uses default title when omitted
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\"label\":\"Game Stats\""
Received string:    "{\"type\":\"bar\",\"data\":{\"labels\":[\"Only\"],\"datasets\":[{\"label\":\"\",\"data\":[3]}]}}"

[Killed] ObjectLiteral
src/chart.ts:7:11
 export async function getChartUrl(data: number[], labels: string[], title = 'Game Stats'): Promise<string> {
   const chartConfig = {
     type: 'bar',
-    data: {
-      labels,
-      datasets: [{ label: title, data }]
-    }
+    data: {}
   };
   const url = `https://quickchart.io/chart?c=${encodeURIComponent(JSON.stringify(chartConfig))}`;
killedBy: platform utility modules getChartUrl returns encoded quickchart URL
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\"labels\":[\"A\",\"B\"]"
Received string:    "{\"type\":\"bar\",\"data\":{}}"

[Killed] ObjectLiteral
src/chart.ts:9:18
     type: 'bar',
     data: {
       labels,
-      datasets: [{ label: title, data }]
+      datasets: [{}]
     }
   };
killedBy: platform utility modules getChartUrl returns encoded quickchart URL
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\"label\":\"Demo\""
Received string:    "{\"type\":\"bar\",\"data\":{\"labels\":[\"A\",\"B\"],\"datasets\":[{}]}}"

[Killed] StringLiteral
src/chart.ts:12:15
       datasets: [{ label: title, data }]
     }
   };
-  const url = `https://quickchart.io/chart?c=${encodeURIComponent(JSON.stringify(chartConfig))}`;
+  const url = ``;
   return url;
 }
killedBy: platform utility modules getChartUrl returns encoded quickchart URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
