[Killed] BlockStatement
src/db.ts:4:69
 // MySQL database connection setup
 import mysql from 'mysql2/promise';
 
-function getDbEnv(name: 'HOST' | 'PORT' | 'USER' | 'PASS' | 'NAME') {
-  return process.env[`DISCORD_GAME_DB_${name}`] ?? process.env[`DB_${name}`];
-}
+function getDbEnv(name: 'HOST' | 'PORT' | 'USER' | 'PASS' | 'NAME') {}
 
 export async function getDbConnection() {
killedBy: db uses DISCORD_GAME_DB_* values with default port 3306
statusReason: Error: Missing database environment variables: DISCORD_GAME_DB_HOST, DISCORD_GAME_DB_USER, DISCORD_GAME_DB_NAME

[Killed] LogicalOperator
src/db.ts:5:10
 import mysql from 'mysql2/promise';
 
 function getDbEnv(name: 'HOST' | 'PORT' | 'USER' | 'PASS' | 'NAME') {
-  return process.env[`DISCORD_GAME_DB_${name}`] ?? process.env[`DB_${name}`];
+  return process.env[`DISCORD_GAME_DB_${name}`] && process.env[`DB_${name}`];
 }
 
killedBy: db uses DISCORD_GAME_DB_* values with default port 3306
statusReason: Error: Missing database environment variables: DISCORD_GAME_DB_HOST, DISCORD_GAME_DB_USER, DISCORD_GAME_DB_NAME

[Killed] StringLiteral
src/db.ts:5:64
 import mysql from 'mysql2/promise';
 
 function getDbEnv(name: 'HOST' | 'PORT' | 'USER' | 'PASS' | 'NAME') {
-  return process.env[`DISCORD_GAME_DB_${name}`] ?? process.env[`DB_${name}`];
+  return process.env[`DISCORD_GAME_DB_${name}`] ?? process.env[``];
 }
 
killedBy: db falls back to DB_* values and parses DB_PORT
statusReason: Error: Missing database environment variables: DISCORD_GAME_DB_HOST, DISCORD_GAME_DB_USER, DISCORD_GAME_DB_NAME

[Killed] BlockStatement
src/db.ts:8:41
   return process.env[`DISCORD_GAME_DB_${name}`] ?? process.env[`DB_${name}`];
 }
 
-export async function getDbConnection() {
-  const requiredVars = ['HOST', 'USER', 'NAME'] as const;
-  const missingVars = requiredVars.filter((name) => !getDbEnv(name));
-
-  if (missingVars.length > 0) {
-    throw new Error(`Missing database environment variables: ${missingVars.map((name) => `DISCORD_GAME_DB_${name}`).join(', ')}`);
-  }
-
-  return mysql.createConnection({
-    host: getDbEnv('HOST'),
-    port: getDbEnv('PORT') ? Number(getDbEnv('PORT')) : 3306,
-    user: getDbEnv('USER'),
-    password: getDbEnv('PASS'),
-    database: getDbEnv('NAME'),
-  });
-}
+export async function getDbConnection() {}
 
killedBy: db throws when required env vars are missing
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ArrowFunction
src/db.ts:10:43
 
 export async function getDbConnection() {
   const requiredVars = ['HOST', 'USER', 'NAME'] as const;
-  const missingVars = requiredVars.filter((name) => !getDbEnv(name));
+  const missingVars = requiredVars.filter(() => undefined);
 
   if (missingVars.length > 0) {
killedBy: db throws when required env vars are missing
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
src/db.ts:10:53
 
 export async function getDbConnection() {
   const requiredVars = ['HOST', 'USER', 'NAME'] as const;
-  const missingVars = requiredVars.filter((name) => !getDbEnv(name));
+  const missingVars = requiredVars.filter((name) => getDbEnv(name));
 
   if (missingVars.length > 0) {
killedBy: db throws when required env vars are missing
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/db.ts:12:7
   const requiredVars = ['HOST', 'USER', 'NAME'] as const;
   const missingVars = requiredVars.filter((name) => !getDbEnv(name));
 
-  if (missingVars.length > 0) {
+  if (missingVars.length <= 0) {
     throw new Error(`Missing database environment variables: ${missingVars.map((name) => `DISCORD_GAME_DB_${name}`).join(', ')}`);
   }
killedBy: db throws when required env vars are missing
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/db.ts:12:31
   const requiredVars = ['HOST', 'USER', 'NAME'] as const;
   const missingVars = requiredVars.filter((name) => !getDbEnv(name));
 
-  if (missingVars.length > 0) {
-    throw new Error(`Missing database environment variables: ${missingVars.map((name) => `DISCORD_GAME_DB_${name}`).join(', ')}`);
-  }
+  if (missingVars.length > 0) {}
 
   return mysql.createConnection({
killedBy: db throws when required env vars are missing
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ArrowFunction
src/db.ts:13:80
   const missingVars = requiredVars.filter((name) => !getDbEnv(name));
 
   if (missingVars.length > 0) {
-    throw new Error(`Missing database environment variables: ${missingVars.map((name) => `DISCORD_GAME_DB_${name}`).join(', ')}`);
+    throw new Error(`Missing database environment variables: ${missingVars.map(() => undefined).join(', ')}`);
   }
 
killedBy: db throws when required env vars are missing
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Missing database environment variables: DISCORD_GAME_DB_HOST, DISCORD_GAME_DB_USER, DISCORD_GAME_DB_NAME"
Received message:   "Missing database environment variables: , , "

      68 |       } else {
      69 |         stryCov_9fa48("54");

[Killed] StringLiteral
src/db.ts:13:122
   const missingVars = requiredVars.filter((name) => !getDbEnv(name));
 
   if (missingVars.length > 0) {
-    throw new Error(`Missing database environment variables: ${missingVars.map((name) => `DISCORD_GAME_DB_${name}`).join(', ')}`);
+    throw new Error(`Missing database environment variables: ${missingVars.map((name) => `DISCORD_GAME_DB_${name}`).join("")}`);
   }
 
killedBy: db throws when required env vars are missing
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Missing database environment variables: DISCORD_GAME_DB_HOST, DISCORD_GAME_DB_USER, DISCORD_GAME_DB_NAME"
Received message:   "Missing database environment variables: DISCORD_GAME_DB_HOSTDISCORD_GAME_DB_USERDISCORD_GAME_DB_NAME"

      68 |       } else {
      69 |         stryCov_9fa48("54");

[Killed] StringLiteral
src/db.ts:17:20
   }
 
   return mysql.createConnection({
-    host: getDbEnv('HOST'),
+    host: getDbEnv(""),
     port: getDbEnv('PORT') ? Number(getDbEnv('PORT')) : 3306,
     user: getDbEnv('USER'),
killedBy: db uses DISCORD_GAME_DB_* values with default port 3306
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "database": "discord_game",
-   "host": "db.internal",
