[Killed] BlockStatement
src/personalize.ts:4:54
 // Personalized offers and targeted messages
 import { getUserReward } from './advanced-commands';
 
-export function getPersonalizedOffer(userId: string) {
-  const reward = getUserReward(userId);
-  if (reward.tier === 'VIP') {
-    return '🎁 VIP Bonus: You get a 10% cashback on your next game!';
-  } else if (reward.tier === 'Gold') {
-    return '✨ Gold Bonus: Play 3 games this week for a $20 bonus!';
-  } else if (reward.tier === 'Silver') {
-    return '💎 Silver Bonus: Refer a friend and get double points!';
-  } else {
-    return '🚀 Play more to unlock exclusive bonuses and rewards!';
-  }
-}
+export function getPersonalizedOffer(userId: string) {}
 
killedBy: platform utility modules getPersonalizedOffer covers tier branches
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] EqualityOperator
src/personalize.ts:6:7
 
 export function getPersonalizedOffer(userId: string) {
   const reward = getUserReward(userId);
-  if (reward.tier === 'VIP') {
+  if (reward.tier !== 'VIP') {
     return '🎁 VIP Bonus: You get a 10% cashback on your next game!';
   } else if (reward.tier === 'Gold') {
killedBy: platform utility modules getPersonalizedOffer covers tier branches
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "VIP Bonus"
Received string:    "🚀 Play more to unlock exclusive bonuses and rewards!"

[Killed] ConditionalExpression
src/personalize.ts:6:7
 
 export function getPersonalizedOffer(userId: string) {
   const reward = getUserReward(userId);
-  if (reward.tier === 'VIP') {
+  if (true) {
     return '🎁 VIP Bonus: You get a 10% cashback on your next game!';
   } else if (reward.tier === 'Gold') {
killedBy: platform utility modules getPersonalizedOffer covers tier branches
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Gold Bonus"
Received string:    "🎁 VIP Bonus: You get a 10% cashback on your next game!"

[Killed] ConditionalExpression
src/personalize.ts:8:14
   const reward = getUserReward(userId);
   if (reward.tier === 'VIP') {
     return '🎁 VIP Bonus: You get a 10% cashback on your next game!';
-  } else if (reward.tier === 'Gold') {
+  } else if (true) {
     return '✨ Gold Bonus: Play 3 games this week for a $20 bonus!';
   } else if (reward.tier === 'Silver') {
killedBy: platform utility modules getPersonalizedOffer covers tier branches
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Silver Bonus"
Received string:    "✨ Gold Bonus: Play 3 games this week for a $20 bonus!"

[Killed] BlockStatement
src/personalize.ts:8:38
   const reward = getUserReward(userId);
   if (reward.tier === 'VIP') {
     return '🎁 VIP Bonus: You get a 10% cashback on your next game!';
-  } else if (reward.tier === 'Gold') {
-    return '✨ Gold Bonus: Play 3 games this week for a $20 bonus!';
-  } else if (reward.tier === 'Silver') {
+  } else if (reward.tier === 'Gold') {} else if (reward.tier === 'Silver') {
     return '💎 Silver Bonus: Refer a friend and get double points!';
   } else {
killedBy: platform utility modules getPersonalizedOffer covers tier branches
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
src/personalize.ts:10:14
     return '🎁 VIP Bonus: You get a 10% cashback on your next game!';
   } else if (reward.tier === 'Gold') {
     return '✨ Gold Bonus: Play 3 games this week for a $20 bonus!';
-  } else if (reward.tier === 'Silver') {
+  } else if (false) {
     return '💎 Silver Bonus: Refer a friend and get double points!';
   } else {
killedBy: platform utility modules getPersonalizedOffer covers tier branches
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Silver Bonus"
Received string:    "🚀 Play more to unlock exclusive bonuses and rewards!"

[Killed] EqualityOperator
src/personalize.ts:10:14
     return '🎁 VIP Bonus: You get a 10% cashback on your next game!';
   } else if (reward.tier === 'Gold') {
     return '✨ Gold Bonus: Play 3 games this week for a $20 bonus!';
-  } else if (reward.tier === 'Silver') {
+  } else if (reward.tier !== 'Silver') {
     return '💎 Silver Bonus: Refer a friend and get double points!';
   } else {
killedBy: platform utility modules getPersonalizedOffer covers tier branches
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Silver Bonus"
Received string:    "🚀 Play more to unlock exclusive bonuses and rewards!"

[Killed] BlockStatement
src/personalize.ts:12:10
     return '✨ Gold Bonus: Play 3 games this week for a $20 bonus!';
   } else if (reward.tier === 'Silver') {
     return '💎 Silver Bonus: Refer a friend and get double points!';
-  } else {
-    return '🚀 Play more to unlock exclusive bonuses and rewards!';
-  }
+  } else {}
 }
 
killedBy: platform utility modules getPersonalizedOffer covers tier branches
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] StringLiteral
src/personalize.ts:13:12
   } else if (reward.tier === 'Silver') {
     return '💎 Silver Bonus: Refer a friend and get double points!';
   } else {
-    return '🚀 Play more to unlock exclusive bonuses and rewards!';
+    return ""
   }
 }
killedBy: platform utility modules getPersonalizedOffer covers tier branches
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "unlock exclusive bonuses"
Received string:    ""
