[Killed] BlockStatement
src/referral.ts:4:58
 // Referral competition and leaderboard logic
 import { getDbConnection } from './db';
 
-export async function getReferralLeaderboard(limit = 10) {
-  const db = await getDbConnection();
-  // Count successful affiliate invites per user
-  const [rows] = await db.execute(`
-    SELECT user_id, COUNT(*) as referrals
-    FROM audit_logs
-    WHERE action = 'send_affiliate_link'
-    GROUP BY user_id
-    ORDER BY referrals DESC
-    LIMIT ?
-  `, [limit]);
-  return rows as any[];
-}
+export async function getReferralLeaderboard(limit = 10) {}
 
 export async function getUserReferralCount(userId: string) {
killedBy: platform utility modules referral helpers return leaderboard and user count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"referrals": 3, "user_id": "u1"}]
Received: undefined

[Killed] BlockStatement
src/referral.ts:18:60
   return rows as any[];
 }
 
-export async function getUserReferralCount(userId: string) {
-  const db = await getDbConnection();
-  const [rows] = await db.execute(
-    'SELECT COUNT(*) as count FROM audit_logs WHERE action = "send_affiliate_link" AND user_id = ?',
-    [userId]
-  );
-  const row = (rows as any[])[0];
-  return row.count;
-}
+export async function getUserReferralCount(userId: string) {}
 
killedBy: platform utility modules referral helpers return leaderboard and user count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: undefined

[Killed] StringLiteral
src/referral.ts:21:5
 export async function getUserReferralCount(userId: string) {
   const db = await getDbConnection();
   const [rows] = await db.execute(
-    'SELECT COUNT(*) as count FROM audit_logs WHERE action = "send_affiliate_link" AND user_id = ?',
+    "",
     [userId]
   );
killedBy: platform utility modules referral helpers return leaderboard and user count
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 3
Expected: "SELECT COUNT(*) as count FROM audit_logs WHERE action = \"send_affiliate_link\" AND user_id = ?", ["u1"]
Received
       2: "
    SELECT user_id, COUNT(*) as referrals
    FROM audit_logs

[Killed] ArrayDeclaration
src/referral.ts:22:5
   const db = await getDbConnection();
   const [rows] = await db.execute(
     'SELECT COUNT(*) as count FROM audit_logs WHERE action = "send_affiliate_link" AND user_id = ?',
-    [userId]
+    []
   );
   const row = (rows as any[])[0];
killedBy: platform utility modules referral helpers return leaderboard and user count
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 3
Expected: "SELECT COUNT(*) as count FROM audit_logs WHERE action = \"send_affiliate_link\" AND user_id = ?", ["u1"]
Received
       2: "
    SELECT user_id, COUNT(*) as referrals
    FROM audit_logs
