[Killed] BlockStatement
src/scraper.ts:7:42
 import { getDbConnection } from './db';
 import { logOperation } from './audit-log';
 
-export async function scrapeStakeCodes() {
-  const res = await fetch('https://stake.us/');
-  const html = await res.text();
-  const $ = cheerio.load(html);
-  const codes: string[] = [];
-  // Example: look for codes in elements with class 'promo-code' (update selector as needed)
-  $('.promo-code').each((_, el) => {
-    codes.push($(el).text().trim());
-  });
-  // Store codes in DB
-  if (codes.length) {
-    const db = await getDbConnection();
-    for (const code of codes) {
-      await db.execute('INSERT IGNORE INTO codes (code, source) VALUES (?, ?)', [code, 'stake.us']);
-      // Log code scrape operation (no user/server context, so use 'system')
-      await logOperation({ userId: 'system', serverId: 'system', action: 'scrape_code', details: `Scraped code: ${code}` });
-    }
-  }
-  return codes;
-}
+export async function scrapeStakeCodes() {}
 
 // Selfmade code generator
killedBy: scraper returns empty list and does not open db connection when no promo codes exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] StringLiteral
src/scraper.ts:8:27
 import { logOperation } from './audit-log';
 
 export async function scrapeStakeCodes() {
-  const res = await fetch('https://stake.us/');
+  const res = await fetch("");
   const html = await res.text();
   const $ = cheerio.load(html);
killedBy: scraper stores and logs each scraped promo code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://stake.us/"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/scraper.ts:13:36
   const $ = cheerio.load(html);
   const codes: string[] = [];
   // Example: look for codes in elements with class 'promo-code' (update selector as needed)
-  $('.promo-code').each((_, el) => {
-    codes.push($(el).text().trim());
-  });
+  $('.promo-code').each((_, el) => {});
   // Store codes in DB
   if (codes.length) {
killedBy: scraper stores and logs each scraped promo code
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "ALPHA1",
-   "BETA2",

[Killed] MethodExpression
src/scraper.ts:14:16
   const codes: string[] = [];
   // Example: look for codes in elements with class 'promo-code' (update selector as needed)
   $('.promo-code').each((_, el) => {
-    codes.push($(el).text().trim());
+    codes.push($(el).text());
   });
   // Store codes in DB
killedBy: scraper stores and logs each scraped promo code
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "ALPHA1",
+   " ALPHA1 ",

[Killed] ConditionalExpression
src/scraper.ts:17:7
     codes.push($(el).text().trim());
   });
   // Store codes in DB
-  if (codes.length) {
+  if (true) {
     const db = await getDbConnection();
     for (const code of codes) {
killedBy: scraper returns empty list and does not open db connection when no promo codes exist
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] BlockStatement
src/scraper.ts:17:21
     codes.push($(el).text().trim());
   });
   // Store codes in DB
-  if (codes.length) {
-    const db = await getDbConnection();
-    for (const code of codes) {
-      await db.execute('INSERT IGNORE INTO codes (code, source) VALUES (?, ?)', [code, 'stake.us']);
-      // Log code scrape operation (no user/server context, so use 'system')
-      await logOperation({ userId: 'system', serverId: 'system', action: 'scrape_code', details: `Scraped code: ${code}` });
-    }
-  }
+  if (codes.length) {}
   return codes;
 }
killedBy: scraper stores and logs each scraped promo code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/scraper.ts:19:31
   // Store codes in DB
   if (codes.length) {
     const db = await getDbConnection();
-    for (const code of codes) {
-      await db.execute('INSERT IGNORE INTO codes (code, source) VALUES (?, ?)', [code, 'stake.us']);
-      // Log code scrape operation (no user/server context, so use 'system')
-      await logOperation({ userId: 'system', serverId: 'system', action: 'scrape_code', details: `Scraped code: ${code}` });
-    }
+    for (const code of codes) {}
   }
   return codes;
killedBy: scraper stores and logs each scraped promo code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] StringLiteral
src/scraper.ts:20:24
   if (codes.length) {
     const db = await getDbConnection();
     for (const code of codes) {
-      await db.execute('INSERT IGNORE INTO codes (code, source) VALUES (?, ?)', [code, 'stake.us']);
+      await db.execute("", [code, 'stake.us']);
       // Log code scrape operation (no user/server context, so use 'system')
       await logOperation({ userId: 'system', serverId: 'system', action: 'scrape_code', details: `Scraped code: ${code}` });
killedBy: scraper stores and logs each scraped promo code
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "INSERT IGNORE INTO codes (code, source) VALUES (?, ?)", ["ALPHA1", "stake.us"]
Received
->     1
          "",
          ["ALPHA1", "stake.us"],

[Killed] StringLiteral
src/scraper.ts:20:88
   if (codes.length) {
     const db = await getDbConnection();
     for (const code of codes) {
-      await db.execute('INSERT IGNORE INTO codes (code, source) VALUES (?, ?)', [code, 'stake.us']);
+      await db.execute('INSERT IGNORE INTO codes (code, source) VALUES (?, ?)', [code, ""]);
       // Log code scrape operation (no user/server context, so use 'system')
       await logOperation({ userId: 'system', serverId: 'system', action: 'scrape_code', details: `Scraped code: ${code}` });
killedBy: scraper stores and logs each scraped promo code
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "INSERT IGNORE INTO codes (code, source) VALUES (?, ?)", ["ALPHA1", "stake.us"]
Received
->     1
          "INSERT IGNORE INTO codes (code, source) VALUES (?, ?)",
          Array [

[Killed] StringLiteral
src/scraper.ts:22:98
     for (const code of codes) {
       await db.execute('INSERT IGNORE INTO codes (code, source) VALUES (?, ?)', [code, 'stake.us']);
       // Log code scrape operation (no user/server context, so use 'system')
-      await logOperation({ userId: 'system', serverId: 'system', action: 'scrape_code', details: `Scraped code: ${code}` });
+      await logOperation({ userId: 'system', serverId: 'system', action: 'scrape_code', details: `` });
     }
   }
killedBy: scraper stores and logs each scraped promo code
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: {"action": "scrape_code", "details": "Scraped code: ALPHA1", "serverId": "system", "userId": "system"}
Received
->     1
          Object {
            "action": "scrape_code",

[Killed] StringLiteral
src/scraper.ts:22:36
     for (const code of codes) {
       await db.execute('INSERT IGNORE INTO codes (code, source) VALUES (?, ?)', [code, 'stake.us']);
       // Log code scrape operation (no user/server context, so use 'system')
-      await logOperation({ userId: 'system', serverId: 'system', action: 'scrape_code', details: `Scraped code: ${code}` });
+      await logOperation({ userId: "", serverId: 'system', action: 'scrape_code', details: `Scraped code: ${code}` });
     }
   }
killedBy: scraper stores and logs each scraped promo code
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: {"action": "scrape_code", "details": "Scraped code: ALPHA1", "serverId": "system", "userId": "system"}
Received
->     1
          Object {
            "action": "scrape_code",

[Killed] BlockStatement
src/scraper.ts:29:66
 }
 
 // Selfmade code generator
-export function generateSelfCode(prefix = 'CYBER44', length = 8) {
-  const chars = 'ABCDEFGHJKLMNPQRSTUVWXYZ23456789';
-  let code = prefix + '-';
-  for (let i = 0; i < length; i++) {
-    code += chars.charAt(Math.floor(Math.random() * chars.length));
-  }
-  return code;
-}
+export function generateSelfCode(prefix = 'CYBER44', length = 8) {}
 
killedBy: generateSelfCode should generate a code with the correct prefix and length
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Killed] StringLiteral
src/scraper.ts:31:23
 // Selfmade code generator
 export function generateSelfCode(prefix = 'CYBER44', length = 8) {
   const chars = 'ABCDEFGHJKLMNPQRSTUVWXYZ23456789';
-  let code = prefix + '-';
+  let code = prefix + "";
   for (let i = 0; i < length; i++) {
     code += chars.charAt(Math.floor(Math.random() * chars.length));
killedBy: generateSelfCode should generate a code with the correct prefix and length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/scraper.ts:32:36
 export function generateSelfCode(prefix = 'CYBER44', length = 8) {
   const chars = 'ABCDEFGHJKLMNPQRSTUVWXYZ23456789';
   let code = prefix + '-';
-  for (let i = 0; i < length; i++) {
-    code += chars.charAt(Math.floor(Math.random() * chars.length));
-  }
+  for (let i = 0; i < length; i++) {}
   return code;
 }
killedBy: generateSelfCode should generate a code with the correct prefix and length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 11
Received: 5

[Killed] EqualityOperator
src/scraper.ts:32:19
 export function generateSelfCode(prefix = 'CYBER44', length = 8) {
   const chars = 'ABCDEFGHJKLMNPQRSTUVWXYZ23456789';
   let code = prefix + '-';
-  for (let i = 0; i < length; i++) {
+  for (let i = 0; i <= length; i++) {
     code += chars.charAt(Math.floor(Math.random() * chars.length));
   }
killedBy: generateSelfCode should generate a code with the correct prefix and length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 11
Received: 12

[Killed] AssignmentOperator
src/scraper.ts:33:5
   const chars = 'ABCDEFGHJKLMNPQRSTUVWXYZ23456789';
   let code = prefix + '-';
   for (let i = 0; i < length; i++) {
-    code += chars.charAt(Math.floor(Math.random() * chars.length));
+    code -= chars.charAt(Math.floor(Math.random() * chars.length));
   }
   return code;
killedBy: generateSelfCode should generate a code with the correct prefix and length
statusReason: TypeError: code.startsWith is not a function

[Killed] MethodExpression
src/scraper.ts:33:13
   const chars = 'ABCDEFGHJKLMNPQRSTUVWXYZ23456789';
   let code = prefix + '-';
   for (let i = 0; i < length; i++) {
-    code += chars.charAt(Math.floor(Math.random() * chars.length));
+    code += chars;
   }
   return code;
killedBy: generateSelfCode should generate a code with the correct prefix and length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 11
Received: 197
