[Killed] BlockStatement
src/virtual-board.ts:6:79
 import { logOperation } from './audit-log';
 
 // Optionally pass user/server for logging
-export async function getVirtualBoardData(userId?: string, serverId?: string) {
-  const db = await getDbConnection();
-  const [rows]: [any[], any] = await db.execute('SELECT code, source, created_at FROM codes ORDER BY created_at DESC LIMIT 50');
-  if (userId && serverId) {
-    await logOperation({ userId, serverId, action: 'view_virtual_board', details: `Viewed ${(rows as any[]).length} codes` });
-  }
-  return rows;
-}
+export async function getVirtualBoardData(userId?: string, serverId?: string) {}
 
killedBy: platform utility modules getVirtualBoardData logs only when user and server are provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"code": "A1", "created_at": "2026-04-01", "source": "stake.us"}]
Received: undefined

[Killed] StringLiteral
src/virtual-board.ts:8:49
 // Optionally pass user/server for logging
 export async function getVirtualBoardData(userId?: string, serverId?: string) {
   const db = await getDbConnection();
-  const [rows]: [any[], any] = await db.execute('SELECT code, source, created_at FROM codes ORDER BY created_at DESC LIMIT 50');
+  const [rows]: [any[], any] = await db.execute("");
   if (userId && serverId) {
     await logOperation({ userId, serverId, action: 'view_virtual_board', details: `Viewed ${(rows as any[]).length} codes` });
killedBy: platform utility modules getVirtualBoardData logs only when user and server are provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "SELECT code, source, created_at FROM codes ORDER BY created_at DESC LIMIT 50"
Received
       1: ""
       2: ""

Number of calls: 2

[Killed] ConditionalExpression
src/virtual-board.ts:9:7
 export async function getVirtualBoardData(userId?: string, serverId?: string) {
   const db = await getDbConnection();
   const [rows]: [any[], any] = await db.execute('SELECT code, source, created_at FROM codes ORDER BY created_at DESC LIMIT 50');
-  if (userId && serverId) {
+  if (false) {
     await logOperation({ userId, serverId, action: 'view_virtual_board', details: `Viewed ${(rows as any[]).length} codes` });
   }
killedBy: platform utility modules getVirtualBoardData logs only when user and server are provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"action": "view_virtual_board", "details": "Viewed 1 codes", "serverId": "guild-1", "userId": "user-1"}

Number of calls: 0

[Killed] LogicalOperator
src/virtual-board.ts:9:7
 export async function getVirtualBoardData(userId?: string, serverId?: string) {
   const db = await getDbConnection();
   const [rows]: [any[], any] = await db.execute('SELECT code, source, created_at FROM codes ORDER BY created_at DESC LIMIT 50');
-  if (userId && serverId) {
+  if (userId || serverId) {
     await logOperation({ userId, serverId, action: 'view_virtual_board', details: `Viewed ${(rows as any[]).length} codes` });
   }
killedBy: platform utility modules getVirtualBoardData logs only when user and server are provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2
