[Survived] LogicalOperator
src/backend/alerting.ts:5:27
 // Real-time alerting hook for security/audit events
 import axios from 'axios';
 
-const ALERT_WEBHOOK_URL = process.env.ALERT_WEBHOOK_URL || 'https://your-alerting-webhook-url';
+const ALERT_WEBHOOK_URL = process.env.ALERT_WEBHOOK_URL && 'https://your-alerting-webhook-url';
 
 export async function sendSecurityAlert(event: {

[Survived] ConditionalExpression
src/backend/alerting.ts:5:27
 // Real-time alerting hook for security/audit events
 import axios from 'axios';
 
-const ALERT_WEBHOOK_URL = process.env.ALERT_WEBHOOK_URL || 'https://your-alerting-webhook-url';
+const ALERT_WEBHOOK_URL = true;
 
 export async function sendSecurityAlert(event: {

[Survived] BlockStatement
src/backend/alerting.ts:13:4
   ip?: string;
   timestamp?: string;
   [key: string]: any;
-}) {
-  try {
-    await axios.post(ALERT_WEBHOOK_URL, {
-      text: `[SECURITY ALERT] ${event.action} for user ${event.userId} from IP ${event.ip} at ${event.timestamp}`,
-      event,
-    });
-  } catch (err) {
-    // Log locally if alerting fails
-    // eslint-disable-next-line no-console
-    console.error('Failed to send security alert', err);
-  }
-}
+}) {}
 
 // CommonJS compatibility for Jest tests

[Survived] BlockStatement
src/backend/alerting.ts:14:7
   timestamp?: string;
   [key: string]: any;
 }) {
-  try {
-    await axios.post(ALERT_WEBHOOK_URL, {
-      text: `[SECURITY ALERT] ${event.action} for user ${event.userId} from IP ${event.ip} at ${event.timestamp}`,
-      event,
-    });
-  } catch (err) {
+  try {} catch (err) {
     // Log locally if alerting fails
     // eslint-disable-next-line no-console

[Survived] ObjectLiteral
src/backend/alerting.ts:15:41
   [key: string]: any;
 }) {
   try {
-    await axios.post(ALERT_WEBHOOK_URL, {
-      text: `[SECURITY ALERT] ${event.action} for user ${event.userId} from IP ${event.ip} at ${event.timestamp}`,
-      event,
-    });
+    await axios.post(ALERT_WEBHOOK_URL, {});
   } catch (err) {
     // Log locally if alerting fails

[Survived] StringLiteral
src/backend/alerting.ts:16:13
 }) {
   try {
     await axios.post(ALERT_WEBHOOK_URL, {
-      text: `[SECURITY ALERT] ${event.action} for user ${event.userId} from IP ${event.ip} at ${event.timestamp}`,
+      text: ``,
       event,
     });

[Survived] BlockStatement
src/backend/alerting.ts:19:17
       text: `[SECURITY ALERT] ${event.action} for user ${event.userId} from IP ${event.ip} at ${event.timestamp}`,
       event,
     });
-  } catch (err) {
-    // Log locally if alerting fails
-    // eslint-disable-next-line no-console
-    console.error('Failed to send security alert', err);
-  }
+  } catch (err) {}
 }
 
