[Timeout] BlockStatement
src/backend/db/index.ts:18:41
   queueLimit: number;
 }
 
-export function getDbConfig(): DbConfig {
-  const env = process.env;
-  const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
-  const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
-  const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
-  const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
-  let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
-  if (isNaN(port)) port = 3306;
-  if (!host || !user || !database) {
-    throw new Error('Missing required DB environment variables. Set DISCORD_GAME_DB_* or DB_*');
-  }
-  return {
-    host,
-    user,
-    password: (typeof password === 'string' && password.length > 0) ? password : undefined,
-    database,
-    port,
-    charset: 'utf8mb4',
-    ssl: { rejectUnauthorized: false },
-    waitForConnections: true,
-    connectionLimit: 10,
-    queueLimit: 0,
-  };
-}
+export function getDbConfig(): DbConfig {}
 
 let pool: Pool | null = null;

[Timeout] LogicalOperator
src/backend/db/index.ts:20:16
 
 export function getDbConfig(): DbConfig {
   const env = process.env;
-  const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
+  const host = env.DISCORD_GAME_DB_HOST && env.DB_HOST;
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;

[Timeout] ConditionalExpression
src/backend/db/index.ts:20:16
 
 export function getDbConfig(): DbConfig {
   const env = process.env;
-  const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
+  const host = false;
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;

[Timeout] LogicalOperator
src/backend/db/index.ts:21:16
 export function getDbConfig(): DbConfig {
   const env = process.env;
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
-  const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
+  const user = env.DISCORD_GAME_DB_USER && env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;

[Timeout] ConditionalExpression
src/backend/db/index.ts:21:16
 export function getDbConfig(): DbConfig {
   const env = process.env;
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
-  const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
+  const user = false;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;

[Timeout] ConditionalExpression
src/backend/db/index.ts:22:20
   const env = process.env;
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
-  const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
+  const password = true;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);

[Timeout] LogicalOperator
src/backend/db/index.ts:22:20
   const env = process.env;
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
-  const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
+  const password = env.DISCORD_GAME_DB_PASS && env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);

[Timeout] LogicalOperator
src/backend/db/index.ts:23:20
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
-  const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
+  const database = env.DISCORD_GAME_DB_NAME && env.DB_NAME;
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
   if (isNaN(port)) port = 3306;

[Timeout] ConditionalExpression
src/backend/db/index.ts:23:20
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
-  const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
+  const database = false;
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
   if (isNaN(port)) port = 3306;

[Timeout] LogicalOperator
src/backend/db/index.ts:24:21
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
-  let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
+  let port = Number(env.DISCORD_GAME_DB_PORT && env.DB_PORT || 3306);
   if (isNaN(port)) port = 3306;
   if (!host || !user || !database) {

[Timeout] ConditionalExpression
src/backend/db/index.ts:24:21
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
-  let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
+  let port = Number(false);
   if (isNaN(port)) port = 3306;
   if (!host || !user || !database) {

[Timeout] ConditionalExpression
src/backend/db/index.ts:25:7
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
-  if (isNaN(port)) port = 3306;
+  if (true) port = 3306;
   if (!host || !user || !database) {
     throw new Error('Missing required DB environment variables. Set DISCORD_GAME_DB_* or DB_*');

[Timeout] ConditionalExpression
src/backend/db/index.ts:25:7
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
-  if (isNaN(port)) port = 3306;
+  if (false) port = 3306;
   if (!host || !user || !database) {
     throw new Error('Missing required DB environment variables. Set DISCORD_GAME_DB_* or DB_*');

[Timeout] BooleanLiteral
src/backend/db/index.ts:26:16
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
   if (isNaN(port)) port = 3306;
-  if (!host || !user || !database) {
+  if (!host || user || !database) {
     throw new Error('Missing required DB environment variables. Set DISCORD_GAME_DB_* or DB_*');
   }

[Timeout] LogicalOperator
src/backend/db/index.ts:26:7
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
   if (isNaN(port)) port = 3306;
-  if (!host || !user || !database) {
+  if (!host && !user || !database) {
     throw new Error('Missing required DB environment variables. Set DISCORD_GAME_DB_* or DB_*');
   }

[Timeout] ObjectLiteral
src/backend/db/index.ts:29:10
   if (!host || !user || !database) {
     throw new Error('Missing required DB environment variables. Set DISCORD_GAME_DB_* or DB_*');
   }
-  return {
-    host,
-    user,
-    password: (typeof password === 'string' && password.length > 0) ? password : undefined,
-    database,
-    port,
-    charset: 'utf8mb4',
-    ssl: { rejectUnauthorized: false },
-    waitForConnections: true,
-    connectionLimit: 10,
-    queueLimit: 0,
-  };
+  return {};
 }
 

[Timeout] ConditionalExpression
src/backend/db/index.ts:32:16
   return {
     host,
     user,
-    password: (typeof password === 'string' && password.length > 0) ? password : undefined,
+    password: (true) ? password : undefined,
     database,
     port,

[Timeout] ConditionalExpression
src/backend/db/index.ts:32:16
   return {
     host,
     user,
-    password: (typeof password === 'string' && password.length > 0) ? password : undefined,
+    password: (true && password.length > 0) ? password : undefined,
     database,
     port,

[Timeout] BooleanLiteral
src/backend/db/index.ts:36:32
     database,
     port,
     charset: 'utf8mb4',
-    ssl: { rejectUnauthorized: false },
+    ssl: { rejectUnauthorized: true },
     waitForConnections: true,
     connectionLimit: 10,

[Timeout] BooleanLiteral
src/backend/db/index.ts:37:25
     port,
     charset: 'utf8mb4',
     ssl: { rejectUnauthorized: false },
-    waitForConnections: true,
+    waitForConnections: false,
     connectionLimit: 10,
     queueLimit: 0,

[Timeout] BlockStatement
src/backend/db/index.ts:44:35
 }
 
 let pool: Pool | null = null;
-export function getDbPool(): Pool {
-  if (!pool) {
-    pool = mysql.createPool(getDbConfig());
-  }
-  return pool;
-}
+export function getDbPool(): Pool {}
 
 // TEST-ONLY: Reset the pool singleton for unit/mutation tests

[Timeout] BlockStatement
src/backend/db/index.ts:45:14
 
 let pool: Pool | null = null;
 export function getDbPool(): Pool {
-  if (!pool) {
-    pool = mysql.createPool(getDbConfig());
-  }
+  if (!pool) {}
   return pool;
 }

[Timeout] BooleanLiteral
src/backend/db/index.ts:45:7
 
 let pool: Pool | null = null;
 export function getDbPool(): Pool {
-  if (!pool) {
+  if (pool) {
     pool = mysql.createPool(getDbConfig());
   }

[Timeout] BlockStatement
src/backend/db/index.ts:52:38
 }
 
 // TEST-ONLY: Reset the pool singleton for unit/mutation tests
-export function __resetPoolForTest() {
-  pool = null;
-}
+export function __resetPoolForTest() {}
 
 // No import-time pool creation or db export!

[Timeout] BlockStatement
src/backend/db/index.ts:59:41
 // No import-time pool creation or db export!
 // Only create pools/connections when explicitly called in code or tests.
 
-export async function getDbConnection() {
-  const env = process.env;
-  let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
-  if (isNaN(port)) port = 3306;
-  const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
-  const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
-  const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
-  const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
-  if (!host || !user || !database) {
-    throw new Error('Missing database environment variables: DISCORD_GAME_DB_HOST, DISCORD_GAME_DB_USER, DISCORD_GAME_DB_NAME');
-  }
-  return await require('mysql2/promise').createConnection({
-    host,
-    port,
-    user,
-    password: (typeof password === 'string' && password.length > 0) ? password : undefined,
-    database,
-    charset: 'utf8mb4',
-    ssl: { rejectUnauthorized: false },
-  });
-}
+export async function getDbConnection() {}
 

[Timeout] ConditionalExpression
src/backend/db/index.ts:61:21
 
 export async function getDbConnection() {
   const env = process.env;
-  let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
+  let port = Number(false);
   if (isNaN(port)) port = 3306;
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;

[Timeout] ConditionalExpression
src/backend/db/index.ts:61:21
 
 export async function getDbConnection() {
   const env = process.env;
-  let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
+  let port = Number(false || 3306);
   if (isNaN(port)) port = 3306;
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;

[Timeout] ConditionalExpression
src/backend/db/index.ts:63:16
   const env = process.env;
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
   if (isNaN(port)) port = 3306;
-  const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
+  const host = false;
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;

[Timeout] LogicalOperator
src/backend/db/index.ts:63:16
   const env = process.env;
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
   if (isNaN(port)) port = 3306;
-  const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
+  const host = env.DISCORD_GAME_DB_HOST && env.DB_HOST;
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;

[Timeout] ConditionalExpression
src/backend/db/index.ts:64:16
   let port = Number(env.DISCORD_GAME_DB_PORT || env.DB_PORT || 3306);
   if (isNaN(port)) port = 3306;
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
-  const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
+  const user = true;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;

[Timeout] ConditionalExpression
src/backend/db/index.ts:65:20
   if (isNaN(port)) port = 3306;
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
-  const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
+  const password = false;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
   if (!host || !user || !database) {

[Timeout] ConditionalExpression
src/backend/db/index.ts:66:20
   const host = env.DISCORD_GAME_DB_HOST || env.DB_HOST;
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
-  const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
+  const database = true;
   if (!host || !user || !database) {
     throw new Error('Missing database environment variables: DISCORD_GAME_DB_HOST, DISCORD_GAME_DB_USER, DISCORD_GAME_DB_NAME');

[Timeout] LogicalOperator
src/backend/db/index.ts:67:7
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
-  if (!host || !user || !database) {
+  if (!host && !user || !database) {
     throw new Error('Missing database environment variables: DISCORD_GAME_DB_HOST, DISCORD_GAME_DB_USER, DISCORD_GAME_DB_NAME');
   }

[Timeout] ConditionalExpression
src/backend/db/index.ts:67:7
   const user = env.DISCORD_GAME_DB_USER || env.DB_USER;
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
-  if (!host || !user || !database) {
+  if (true) {
     throw new Error('Missing database environment variables: DISCORD_GAME_DB_HOST, DISCORD_GAME_DB_USER, DISCORD_GAME_DB_NAME');
   }

[Timeout] StringLiteral
src/backend/db/index.ts:68:21
   const password = env.DISCORD_GAME_DB_PASS || env.DB_PASS;
   const database = env.DISCORD_GAME_DB_NAME || env.DB_NAME;
   if (!host || !user || !database) {
-    throw new Error('Missing database environment variables: DISCORD_GAME_DB_HOST, DISCORD_GAME_DB_USER, DISCORD_GAME_DB_NAME');
+    throw new Error("");
   }
   return await require('mysql2/promise').createConnection({

[Timeout] ConditionalExpression
src/backend/db/index.ts:74:16
     host,
     port,
     user,
-    password: (typeof password === 'string' && password.length > 0) ? password : undefined,
+    password: (false) ? password : undefined,
     database,
     charset: 'utf8mb4',

[Timeout] LogicalOperator
src/backend/db/index.ts:74:16
     host,
     port,
     user,
-    password: (typeof password === 'string' && password.length > 0) ? password : undefined,
+    password: (typeof password === 'string' || password.length > 0) ? password : undefined,
     database,
     charset: 'utf8mb4',
