[Survived] BlockStatement
src/backend/routes/offer.ts:10:52
 import { sanitizeObject } from '../security/sanitize';
 
 export async function offerRoutes(fastify: FastifyInstance) {
-  fastify.post('/api/offer', async (req, reply) => {
-    let body = req.body as any;
-    body = sanitizeObject(body);
-    const { error } = validateOfferInput(body);
-    if (error) return reply.status(400).send({ error: error.message });
-    const { userId, btcAmount, usdAmount } = body;
-    const id = uuidv4();
-    const query = 'INSERT INTO offers (id, user_id, type, btc_amount, usd_amount, status) VALUES (?, ?, ?, ?, ?, ?)';
-    const params = [id, userId, 'SELL', btcAmount, usdAmount, 'CREATED'];
-    detectAnomaly(query, params, { userId, ip: req.ip });
-    await getDbPool().execute(query, params);
-    auditLog.logOperation({
-      action: 'offer_create',
-      userId,
-      btcAmount,
-      usdAmount,
-      offerId: id,
-      ip: req.ip,
-      timestamp: new Date().toISOString()
-    });
-    return { id };
-  });
+  fastify.post('/api/offer', async (req, reply) => {});
 
   fastify.get('/api/offers', async (_req, reply) => {

[Survived] StringLiteral
src/backend/routes/offer.ts:10:16
 import { sanitizeObject } from '../security/sanitize';
 
 export async function offerRoutes(fastify: FastifyInstance) {
-  fastify.post('/api/offer', async (req, reply) => {
+  fastify.post("", async (req, reply) => {
     let body = req.body as any;
     body = sanitizeObject(body);

[Survived] ConditionalExpression
src/backend/routes/offer.ts:14:9
     let body = req.body as any;
     body = sanitizeObject(body);
     const { error } = validateOfferInput(body);
-    if (error) return reply.status(400).send({ error: error.message });
+    if (true) return reply.status(400).send({ error: error.message });
     const { userId, btcAmount, usdAmount } = body;
     const id = uuidv4();

[Survived] ConditionalExpression
src/backend/routes/offer.ts:14:9
     let body = req.body as any;
     body = sanitizeObject(body);
     const { error } = validateOfferInput(body);
-    if (error) return reply.status(400).send({ error: error.message });
+    if (false) return reply.status(400).send({ error: error.message });
     const { userId, btcAmount, usdAmount } = body;
     const id = uuidv4();

[Survived] ArrayDeclaration
src/backend/routes/offer.ts:18:20
     const { userId, btcAmount, usdAmount } = body;
     const id = uuidv4();
     const query = 'INSERT INTO offers (id, user_id, type, btc_amount, usd_amount, status) VALUES (?, ?, ?, ?, ?, ?)';
-    const params = [id, userId, 'SELL', btcAmount, usdAmount, 'CREATED'];
+    const params = [];
     detectAnomaly(query, params, { userId, ip: req.ip });
     await getDbPool().execute(query, params);

[Survived] ObjectLiteral
src/backend/routes/offer.ts:19:34
     const id = uuidv4();
     const query = 'INSERT INTO offers (id, user_id, type, btc_amount, usd_amount, status) VALUES (?, ?, ?, ?, ?, ?)';
     const params = [id, userId, 'SELL', btcAmount, usdAmount, 'CREATED'];
-    detectAnomaly(query, params, { userId, ip: req.ip });
+    detectAnomaly(query, params, {});
     await getDbPool().execute(query, params);
     auditLog.logOperation({

[Survived] BlockStatement
src/backend/routes/offer.ts:33:53
     return { id };
   });
 
-  fastify.get('/api/offers', async (_req, reply) => {
-    const query = 'SELECT * FROM offers WHERE status="CREATED"';
-    detectAnomaly(query, [], { ip: _req.ip });
-    const [rows] = await getDbPool().execute(query);
-    return rows;
-  });
+  fastify.get('/api/offers', async (_req, reply) => {});
 }
 

[Survived] StringLiteral
src/backend/routes/offer.ts:34:19
   });
 
   fastify.get('/api/offers', async (_req, reply) => {
-    const query = 'SELECT * FROM offers WHERE status="CREATED"';
+    const query = "";
     detectAnomaly(query, [], { ip: _req.ip });
     const [rows] = await getDbPool().execute(query);

[Survived] ArrayDeclaration
src/backend/routes/offer.ts:35:26
 
   fastify.get('/api/offers', async (_req, reply) => {
     const query = 'SELECT * FROM offers WHERE status="CREATED"';
-    detectAnomaly(query, [], { ip: _req.ip });
+    detectAnomaly(query, ["Stryker was here"], { ip: _req.ip });
     const [rows] = await getDbPool().execute(query);
     return rows;
