[Survived] StringLiteral
src/backend/routes/trade.ts:10:16
 import { sanitizeObject } from '../security/sanitize';
 
 export async function tradeRoutes(fastify: FastifyInstance) {
-  fastify.post('/api/trade/accept', async (req, reply) => {
+  fastify.post("", async (req, reply) => {
     let body = req.body as any;
     body = sanitizeObject(body);

[Survived] ConditionalExpression
src/backend/routes/trade.ts:14:9
     let body = req.body as any;
     body = sanitizeObject(body);
     const { error } = validateTradeAcceptInput(body);
-    if (error) return reply.status(400).send({ error: error.message });
+    if (false) return reply.status(400).send({ error: error.message });
     const { offerId, buyerId } = body;
     const tradeId = uuidv4();

[Survived] ConditionalExpression
src/backend/routes/trade.ts:14:9
     let body = req.body as any;
     body = sanitizeObject(body);
     const { error } = validateTradeAcceptInput(body);
-    if (error) return reply.status(400).send({ error: error.message });
+    if (true) return reply.status(400).send({ error: error.message });
     const { offerId, buyerId } = body;
     const tradeId = uuidv4();

[Survived] ArrayDeclaration
src/backend/routes/trade.ts:18:32
     const { offerId, buyerId } = body;
     const tradeId = uuidv4();
     const selectQuery = 'SELECT * FROM offers WHERE id=?';
-    detectAnomaly(selectQuery, [offerId], { userId: buyerId, ip: req.ip });
+    detectAnomaly(selectQuery, [], { userId: buyerId, ip: req.ip });
     const [rows]: any = await getDbPool().execute(selectQuery, [offerId]);
     const offer = rows[0];

[Survived] ObjectLiteral
src/backend/routes/trade.ts:18:43
     const { offerId, buyerId } = body;
     const tradeId = uuidv4();
     const selectQuery = 'SELECT * FROM offers WHERE id=?';
-    detectAnomaly(selectQuery, [offerId], { userId: buyerId, ip: req.ip });
+    detectAnomaly(selectQuery, [offerId], {});
     const [rows]: any = await getDbPool().execute(selectQuery, [offerId]);
     const offer = rows[0];

[Survived] ArithmeticOperator
src/backend/routes/trade.ts:21:17
     detectAnomaly(selectQuery, [offerId], { userId: buyerId, ip: req.ip });
     const [rows]: any = await getDbPool().execute(selectQuery, [offerId]);
     const offer = rows[0];
-    const fee = offer.btc_amount * 0.005;
+    const fee = offer.btc_amount / 0.005;
     const insertQuery = 'INSERT INTO trades (id, offer_id, buyer_id, seller_id, btc_locked, fee, status) VALUES (?, ?, ?, ?, ?, ?, ?)';
     const insertParams = [tradeId, offerId, buyerId, offer.user_id, offer.btc_amount, fee, 'FUNDED'];

[Survived] StringLiteral
src/backend/routes/trade.ts:22:25
     const [rows]: any = await getDbPool().execute(selectQuery, [offerId]);
     const offer = rows[0];
     const fee = offer.btc_amount * 0.005;
-    const insertQuery = 'INSERT INTO trades (id, offer_id, buyer_id, seller_id, btc_locked, fee, status) VALUES (?, ?, ?, ?, ?, ?, ?)';
+    const insertQuery = "";
     const insertParams = [tradeId, offerId, buyerId, offer.user_id, offer.btc_amount, fee, 'FUNDED'];
     detectAnomaly(insertQuery, insertParams, { userId: buyerId, ip: req.ip });

[Survived] StringLiteral
src/backend/routes/trade.ts:23:92
     const offer = rows[0];
     const fee = offer.btc_amount * 0.005;
     const insertQuery = 'INSERT INTO trades (id, offer_id, buyer_id, seller_id, btc_locked, fee, status) VALUES (?, ?, ?, ?, ?, ?, ?)';
-    const insertParams = [tradeId, offerId, buyerId, offer.user_id, offer.btc_amount, fee, 'FUNDED'];
+    const insertParams = [tradeId, offerId, buyerId, offer.user_id, offer.btc_amount, fee, ""];
     detectAnomaly(insertQuery, insertParams, { userId: buyerId, ip: req.ip });
     await getDbPool().execute(insertQuery, insertParams);

[Survived] StringLiteral
src/backend/routes/trade.ts:26:30
     const insertParams = [tradeId, offerId, buyerId, offer.user_id, offer.btc_amount, fee, 'FUNDED'];
     detectAnomaly(insertQuery, insertParams, { userId: buyerId, ip: req.ip });
     await getDbPool().execute(insertQuery, insertParams);
-    const updateOfferQuery = 'UPDATE offers SET status="ACCEPTED" WHERE id=?';
+    const updateOfferQuery = "";
     detectAnomaly(updateOfferQuery, [offerId], { userId: buyerId, ip: req.ip });
     await getDbPool().execute(updateOfferQuery, [offerId]);

[Survived] StringLiteral
src/backend/routes/trade.ts:30:15
     detectAnomaly(updateOfferQuery, [offerId], { userId: buyerId, ip: req.ip });
     await getDbPool().execute(updateOfferQuery, [offerId]);
     auditLog.logOperation({
-      action: 'trade_accept',
+      action: "",
       offerId,
       buyerId,

[Survived] ObjectLiteral
src/backend/routes/trade.ts:40:12
       ip: req.ip,
       timestamp: new Date().toISOString()
     });
-    return { tradeId };
+    return {};
   });
 

[Survived] BlockStatement
src/backend/routes/trade.ts:43:60
     return { tradeId };
   });
 
-  fastify.post('/api/trade/confirm', async (req, reply) => {
-    let body = req.body as any;
-    body = sanitizeObject(body);
-    const { error } = validateTradeConfirmInput(body);
-    if (error) return reply.status(400).send({ error: error.message });
-    const { tradeId } = body;
-    const updateTradeQuery = 'UPDATE trades SET status="COMPLETED" WHERE id=?';
-    detectAnomaly(updateTradeQuery, [tradeId], { ip: req.ip });
-    await getDbPool().execute(updateTradeQuery, [tradeId]);
-    auditLog.logOperation({
-      action: 'trade_confirm',
-      tradeId,
-      ip: req.ip,
-      timestamp: new Date().toISOString()
-    });
-    return { success: true };
-  });
+  fastify.post('/api/trade/confirm', async (req, reply) => {});
 }
 

[Survived] StringLiteral
src/backend/routes/trade.ts:43:16
     return { tradeId };
   });
 
-  fastify.post('/api/trade/confirm', async (req, reply) => {
+  fastify.post("", async (req, reply) => {
     let body = req.body as any;
     body = sanitizeObject(body);

[Survived] ConditionalExpression
src/backend/routes/trade.ts:47:9
     let body = req.body as any;
     body = sanitizeObject(body);
     const { error } = validateTradeConfirmInput(body);
-    if (error) return reply.status(400).send({ error: error.message });
+    if (false) return reply.status(400).send({ error: error.message });
     const { tradeId } = body;
     const updateTradeQuery = 'UPDATE trades SET status="COMPLETED" WHERE id=?';

[Survived] ConditionalExpression
src/backend/routes/trade.ts:47:9
     let body = req.body as any;
     body = sanitizeObject(body);
     const { error } = validateTradeConfirmInput(body);
-    if (error) return reply.status(400).send({ error: error.message });
+    if (true) return reply.status(400).send({ error: error.message });
     const { tradeId } = body;
     const updateTradeQuery = 'UPDATE trades SET status="COMPLETED" WHERE id=?';

[Survived] BooleanLiteral
src/backend/routes/trade.ts:58:23
       ip: req.ip,
       timestamp: new Date().toISOString()
     });
-    return { success: true };
+    return { success: false };
   });
 }
