[Survived] BlockStatement
src/backend/siem.ts:4:43
 // src/backend/siem.ts
 // SIEM integration stub for security events
 
-export function forwardToSIEM(event: any) {
-  // Implement SIEM forwarding logic here
-  // For now, just log
-  // eslint-disable-next-line no-console
-  console.log('[SIEM] Forwarded event:', event);
-}
+export function forwardToSIEM(event: any) {}
 
 // CommonJS compatibility for Jest tests

[Survived] StringLiteral
src/backend/siem.ts:8:15
   // Implement SIEM forwarding logic here
   // For now, just log
   // eslint-disable-next-line no-console
-  console.log('[SIEM] Forwarded event:', event);
+  console.log("", event);
 }
 
