[Survived] ObjectLiteral
src/backend/validation/offer.ts:4:32
 import Joi from 'joi';
 
 
-const offerSchema = Joi.object({
-  userId: Joi.string()
-    .min(1)
-    .max(64)
-    .pattern(/^[a-zA-Z0-9_\-]+$/)
-    .required()
-    .messages({
-      'string.pattern.base': 'userId contains invalid characters',
-    }),
-  btcAmount: Joi.number().positive().required(),
-  usdAmount: Joi.number().positive().required(),
-});
+const offerSchema = Joi.object({});
 
 export function validateOfferInput(input: any) {

[Survived] MethodExpression
src/backend/validation/offer.ts:5:11
 
 
 const offerSchema = Joi.object({
-  userId: Joi.string()
-    .min(1)
+  userId: Joi.string().max(1)
     .max(64)
     .pattern(/^[a-zA-Z0-9_\-]+$/)

[Survived] MethodExpression
src/backend/validation/offer.ts:5:11
 
 
 const offerSchema = Joi.object({
-  userId: Joi.string()
-    .min(1)
-    .max(64)
+  userId: Joi.string().min(1).min(64)
     .pattern(/^[a-zA-Z0-9_\-]+$/)
     .required()

[Survived] Regex
src/backend/validation/offer.ts:8:14
   userId: Joi.string()
     .min(1)
     .max(64)
-    .pattern(/^[a-zA-Z0-9_\-]+$/)
+    .pattern(/^[a-zA-Z0-9_\-]+/)
     .required()
     .messages({

[Survived] BlockStatement
src/backend/validation/offer.ts:17:48
   usdAmount: Joi.number().positive().required(),
 });
 
-export function validateOfferInput(input: any) {
-  return offerSchema.validate(input);
-}
+export function validateOfferInput(input: any) {}
 
