[Survived] MethodExpression
src/backend/validation/trade.ts:4:12
 import Joi from 'joi';
 
 export const tradeAcceptSchema = Joi.object({
-  offerId: Joi.string().min(1).required(),
+  offerId: Joi.string().max(1).required(),
   buyerId: Joi.string().min(1).required(),
 });

[Survived] MethodExpression
src/backend/validation/trade.ts:5:12
 
 export const tradeAcceptSchema = Joi.object({
   offerId: Joi.string().min(1).required(),
-  buyerId: Joi.string().min(1).required(),
+  buyerId: Joi.string().max(1).required(),
 });
 

[Survived] MethodExpression
src/backend/validation/trade.ts:9:12
 });
 
 export const tradeConfirmSchema = Joi.object({
-  tradeId: Joi.string().min(1).required(),
+  tradeId: Joi.string().max(1).required(),
 });
 

[Survived] BlockStatement
src/backend/validation/trade.ts:12:54
   tradeId: Joi.string().min(1).required(),
 });
 
-export function validateTradeAcceptInput(input: any) {
-  return tradeAcceptSchema.validate(input);
-}
+export function validateTradeAcceptInput(input: any) {}
 
 export function validateTradeConfirmInput(input: any) {

[Survived] BlockStatement
src/backend/validation/trade.ts:16:55
   return tradeAcceptSchema.validate(input);
 }
 
-export function validateTradeConfirmInput(input: any) {
-  return tradeConfirmSchema.validate(input);
-}
+export function validateTradeConfirmInput(input: any) {}
 
