[Survived] ArrayDeclaration
src/bot/bot.ts:5:38
 import { Client, GatewayIntentBits } from 'discord.js';
 import axios from 'axios';
 
-const client = new Client({ intents: [GatewayIntentBits.Guilds, GatewayIntentBits.GuildMessages] });
+const client = new Client({ intents: [] });
 
 client.on('messageCreate', async (msg) => {

[Survived] BlockStatement
src/bot/bot.ts:7:43
 
 const client = new Client({ intents: [GatewayIntentBits.Guilds, GatewayIntentBits.GuildMessages] });
 
-client.on('messageCreate', async (msg) => {
-  if (msg.content.startsWith('/sell')) {
-    try {
-      const [_, btc, usd] = msg.content.split(' ');
-      const res = await axios.post('http://localhost:4000/api/offer', {
-        userId: msg.author.id,
-        btcAmount: btc,
-        usdAmount: usd
-      });
-      if (res && res.data && res.data.id) {
-        msg.reply(`Offer created: ${res.data.id}`);
-      } else {
-        msg.reply('Offer creation failed.');
-      }
-    } catch (err) {
-      // Optionally log error
-      // console.error('Failed to create offer:', err);
-      // Optionally reply with error message
-      // msg.reply('Failed to create offer.');
-    }
-  }
-});
+client.on('messageCreate', async (msg) => {});
 
 client.login(process.env.DISCORD_TOKEN);

[Survived] ConditionalExpression
src/bot/bot.ts:8:7
 const client = new Client({ intents: [GatewayIntentBits.Guilds, GatewayIntentBits.GuildMessages] });
 
 client.on('messageCreate', async (msg) => {
-  if (msg.content.startsWith('/sell')) {
+  if (true) {
     try {
       const [_, btc, usd] = msg.content.split(' ');

[Survived] BlockStatement
src/bot/bot.ts:8:40
 const client = new Client({ intents: [GatewayIntentBits.Guilds, GatewayIntentBits.GuildMessages] });
 
 client.on('messageCreate', async (msg) => {
-  if (msg.content.startsWith('/sell')) {
-    try {
-      const [_, btc, usd] = msg.content.split(' ');
-      const res = await axios.post('http://localhost:4000/api/offer', {
-        userId: msg.author.id,
-        btcAmount: btc,
-        usdAmount: usd
-      });
-      if (res && res.data && res.data.id) {
-        msg.reply(`Offer created: ${res.data.id}`);
-      } else {
-        msg.reply('Offer creation failed.');
-      }
-    } catch (err) {
-      // Optionally log error
-      // console.error('Failed to create offer:', err);
-      // Optionally reply with error message
-      // msg.reply('Failed to create offer.');
-    }
-  }
+  if (msg.content.startsWith('/sell')) {}
 });
 

[Survived] BlockStatement
src/bot/bot.ts:9:9
 
 client.on('messageCreate', async (msg) => {
   if (msg.content.startsWith('/sell')) {
-    try {
-      const [_, btc, usd] = msg.content.split(' ');
-      const res = await axios.post('http://localhost:4000/api/offer', {
-        userId: msg.author.id,
-        btcAmount: btc,
-        usdAmount: usd
-      });
-      if (res && res.data && res.data.id) {
-        msg.reply(`Offer created: ${res.data.id}`);
-      } else {
-        msg.reply('Offer creation failed.');
-      }
-    } catch (err) {
+    try {} catch (err) {
       // Optionally log error
       // console.error('Failed to create offer:', err);

[Survived] LogicalOperator
src/bot/bot.ts:16:11
         btcAmount: btc,
         usdAmount: usd
       });
-      if (res && res.data && res.data.id) {
+      if (res || res.data && res.data.id) {
         msg.reply(`Offer created: ${res.data.id}`);
       } else {

[Survived] LogicalOperator
src/bot/bot.ts:16:11
         btcAmount: btc,
         usdAmount: usd
       });
-      if (res && res.data && res.data.id) {
+      if (res && res.data || res.data.id) {
         msg.reply(`Offer created: ${res.data.id}`);
       } else {

[Survived] BlockStatement
src/bot/bot.ts:18:14
       });
       if (res && res.data && res.data.id) {
         msg.reply(`Offer created: ${res.data.id}`);
-      } else {
-        msg.reply('Offer creation failed.');
-      }
+      } else {}
     } catch (err) {
       // Optionally log error
