[Timeout] BlockStatement
src/coin-exchange.ts:3:48
 // Stubs for compatibility with legacy tests
 import * as auditLog from './audit-log';
-export async function transferCoins(opts: any) {
-  auditLog.logOperation();
-  // TODO: Implement or migrate to service
-  return {};
-}
+export async function transferCoins(opts: any) {}
 
 export async function getCoinExchangeOverview() {

[Timeout] BlockStatement
src/coin-exchange.ts:9:49
   return {};
 }
 
-export async function getCoinExchangeOverview() {
-  // TODO: Implement or migrate to service
-  return {};
-}
+export async function getCoinExchangeOverview() {}
 declare global {
   // eslint-disable-next-line no-var

[Timeout] BlockStatement
src/coin-exchange.ts:18:60
   var mockEnd: (() => void) | undefined;
 }
 // Stubs for all required coin-exchange exports for test compatibility
-export function parseCoinAmount(input: any): number | null {
-  if (typeof input !== 'string' && typeof input !== 'number') return null;
-  const n = Number(input);
-  if (!Number.isFinite(n) || n <= 0) return null;
-  return Math.round(n * 100) / 100;
-}
+export function parseCoinAmount(input: any): number | null {}
 
 

[Timeout] LogicalOperator
src/coin-exchange.ts:19:7
 }
 // Stubs for all required coin-exchange exports for test compatibility
 export function parseCoinAmount(input: any): number | null {
-  if (typeof input !== 'string' && typeof input !== 'number') return null;
+  if (typeof input !== 'string' || typeof input !== 'number') return null;
   const n = Number(input);
   if (!Number.isFinite(n) || n <= 0) return null;

[Timeout] EqualityOperator
src/coin-exchange.ts:19:36
 }
 // Stubs for all required coin-exchange exports for test compatibility
 export function parseCoinAmount(input: any): number | null {
-  if (typeof input !== 'string' && typeof input !== 'number') return null;
+  if (typeof input !== 'string' && typeof input === 'number') return null;
   const n = Number(input);
   if (!Number.isFinite(n) || n <= 0) return null;

[Timeout] EqualityOperator
src/coin-exchange.ts:21:30
 export function parseCoinAmount(input: any): number | null {
   if (typeof input !== 'string' && typeof input !== 'number') return null;
   const n = Number(input);
-  if (!Number.isFinite(n) || n <= 0) return null;
+  if (!Number.isFinite(n) || n < 0) return null;
   return Math.round(n * 100) / 100;
 }

[Timeout] ConditionalExpression
src/coin-exchange.ts:21:7
 export function parseCoinAmount(input: any): number | null {
   if (typeof input !== 'string' && typeof input !== 'number') return null;
   const n = Number(input);
-  if (!Number.isFinite(n) || n <= 0) return null;
+  if (false) return null;
   return Math.round(n * 100) / 100;
 }

[Timeout] ArithmeticOperator
src/coin-exchange.ts:22:10
   if (typeof input !== 'string' && typeof input !== 'number') return null;
   const n = Number(input);
   if (!Number.isFinite(n) || n <= 0) return null;
-  return Math.round(n * 100) / 100;
+  return Math.round(n * 100) * 100;
 }
 

[Timeout] ArithmeticOperator
src/coin-exchange.ts:22:21
   if (typeof input !== 'string' && typeof input !== 'number') return null;
   const n = Number(input);
   if (!Number.isFinite(n) || n <= 0) return null;
-  return Math.round(n * 100) / 100;
+  return Math.round(n / 100) / 100;
 }
 
