[Timeout] StringLiteral
src/services/coin.service.ts:10:19
   validateGrantCoinsInput(opts);
   const { actorUserId, targetUserId, amount, serverId, details } = opts;
   const userId = `${serverId}:${targetUserId}`;
-  const actorId = `${serverId}:${actorUserId}`;
+  const actorId = ``;
   const conn = await getDbPool().getConnection();
   try {

[Timeout] ArrayDeclaration
src/services/coin.service.ts:20:7
     );
     const [rows] = await conn.execute(
       'SELECT available_balance, locked_balance FROM coin_wallets WHERE user_id=?',
-      [userId]
+      []
     );
     const walletRow = Array.isArray(rows) && rows.length > 0 && 'available_balance' in rows[0] ? rows[0] : { available_balance: 0, locked_balance: 0 };

[Timeout] EqualityOperator
src/services/coin.service.ts:22:46
       'SELECT available_balance, locked_balance FROM coin_wallets WHERE user_id=?',
       [userId]
     );
-    const walletRow = Array.isArray(rows) && rows.length > 0 && 'available_balance' in rows[0] ? rows[0] : { available_balance: 0, locked_balance: 0 };
+    const walletRow = Array.isArray(rows) && rows.length <= 0 && 'available_balance' in rows[0] ? rows[0] : { available_balance: 0, locked_balance: 0 };
     const newAvailable = Number(walletRow.available_balance) + amount;
     await conn.execute(

[Timeout] LogicalOperator
src/services/coin.service.ts:22:23
       'SELECT available_balance, locked_balance FROM coin_wallets WHERE user_id=?',
       [userId]
     );
-    const walletRow = Array.isArray(rows) && rows.length > 0 && 'available_balance' in rows[0] ? rows[0] : { available_balance: 0, locked_balance: 0 };
+    const walletRow = Array.isArray(rows) || rows.length > 0 && 'available_balance' in rows[0] ? rows[0] : { available_balance: 0, locked_balance: 0 };
     const newAvailable = Number(walletRow.available_balance) + amount;
     await conn.execute(

[Timeout] ArithmeticOperator
src/services/coin.service.ts:23:26
       [userId]
     );
     const walletRow = Array.isArray(rows) && rows.length > 0 && 'available_balance' in rows[0] ? rows[0] : { available_balance: 0, locked_balance: 0 };
-    const newAvailable = Number(walletRow.available_balance) + amount;
+    const newAvailable = Number(walletRow.available_balance) - amount;
     await conn.execute(
       'UPDATE coin_wallets SET available_balance=? WHERE user_id=?',

[Timeout] StringLiteral
src/services/coin.service.ts:25:7
     const walletRow = Array.isArray(rows) && rows.length > 0 && 'available_balance' in rows[0] ? rows[0] : { available_balance: 0, locked_balance: 0 };
     const newAvailable = Number(walletRow.available_balance) + amount;
     await conn.execute(
-      'UPDATE coin_wallets SET available_balance=? WHERE user_id=?',
+      "",
       [newAvailable, userId]
     );

[Timeout] LogicalOperator
src/services/coin.service.ts:30:57
     );
     await conn.execute(
       'INSERT INTO coin_transactions (user_id, direction, kind, amount, balance_after, details, actor_user_id) VALUES (?, ?, ?, ?, ?, ?, ?)',
-      [userId, 'credit', 'grant', amount, newAvailable, details || '', actorId]
+      [userId, 'credit', 'grant', amount, newAvailable, details && '', actorId]
     );
     await conn.commit();

[Timeout] ConditionalExpression
src/services/coin.service.ts:30:57
     );
     await conn.execute(
       'INSERT INTO coin_transactions (user_id, direction, kind, amount, balance_after, details, actor_user_id) VALUES (?, ?, ?, ?, ?, ?, ?)',
-      [userId, 'credit', 'grant', amount, newAvailable, details || '', actorId]
+      [userId, 'credit', 'grant', amount, newAvailable, true, actorId]
     );
     await conn.commit();

[Timeout] ArithmeticOperator
src/services/coin.service.ts:46:21
       userId,
       availableBalance: newAvailable,
       lockedBalance: Number(walletRow.locked_balance),
-      totalBalance: newAvailable + Number(walletRow.locked_balance),
+      totalBalance: newAvailable - Number(walletRow.locked_balance),
     };
   } catch (err) {

[Timeout] BlockStatement
src/services/coin.service.ts:48:17
       lockedBalance: Number(walletRow.locked_balance),
       totalBalance: newAvailable + Number(walletRow.locked_balance),
     };
-  } catch (err) {
-    await conn.rollback();
-    throw err;
-  } finally {
+  } catch (err) {} finally {
     if (typeof conn.end === 'function') {
       await conn.end();

[Timeout] BlockStatement
src/services/coin.service.ts:51:13
   } catch (err) {
     await conn.rollback();
     throw err;
-  } finally {
-    if (typeof conn.end === 'function') {
-      await conn.end();
-    }
-    if (typeof global.mockEnd === 'function') global.mockEnd();
-  }
+  } finally {}
 }
 

[Timeout] EqualityOperator
src/services/coin.service.ts:52:9
     await conn.rollback();
     throw err;
   } finally {
-    if (typeof conn.end === 'function') {
+    if (typeof conn.end !== 'function') {
       await conn.end();
     }

[Timeout] ConditionalExpression
src/services/coin.service.ts:52:9
     await conn.rollback();
     throw err;
   } finally {
-    if (typeof conn.end === 'function') {
+    if (false) {
       await conn.end();
     }

[Timeout] ConditionalExpression
src/services/coin.service.ts:55:9
     if (typeof conn.end === 'function') {
       await conn.end();
     }
-    if (typeof global.mockEnd === 'function') global.mockEnd();
+    if (true) global.mockEnd();
   }
 }

[Timeout] EqualityOperator
src/services/coin.service.ts:55:9
     if (typeof conn.end === 'function') {
       await conn.end();
     }
-    if (typeof global.mockEnd === 'function') global.mockEnd();
+    if (typeof global.mockEnd !== 'function') global.mockEnd();
   }
 }
