[Timeout] BlockStatement
src/services/offer.service.ts:3:71
 import * as auditLog from '../audit-log';
 
-export async function createExchangeOffer(opts: any): Promise<number> {
-  // TODO: Add input validation and DB logic
-  auditLog.logOperation();
-  return 42;
-}
+export async function createExchangeOffer(opts: any): Promise<number> {}
 
 export async function acceptExchangeOffer(opts: any): Promise<object> {

[Timeout] BlockStatement
src/services/offer.service.ts:9:71
   return 42;
 }
 
-export async function acceptExchangeOffer(opts: any): Promise<object> {
-  // TODO: Add input validation and DB logic
-  auditLog.logOperation();
-  return {};
-}
+export async function acceptExchangeOffer(opts: any): Promise<object> {}
 
 export async function cancelExchangeOffer(opts: any): Promise<object> {

[Timeout] BlockStatement
src/services/offer.service.ts:15:71
   return {};
 }
 
-export async function cancelExchangeOffer(opts: any): Promise<object> {
-  // TODO: Add input validation and DB logic
-  auditLog.logOperation();
-  return {};
-}
+export async function cancelExchangeOffer(opts: any): Promise<object> {}
 
 export async function listUserOffers(userId: string): Promise<any[]> {

[Timeout] BlockStatement
src/services/offer.service.ts:21:70
   return {};
 }
 
-export async function listUserOffers(userId: string): Promise<any[]> {
-  if (typeof global.mockEnd === 'function') global.mockEnd();
-  // TODO: Add DB logic
-  return [{ id: 2, senderUserId: 'u1', recipientUserId: 'u2', amount: 5.5 }];
-}
+export async function listUserOffers(userId: string): Promise<any[]> {}
 

[Timeout] ConditionalExpression
src/services/offer.service.ts:22:7
 }
 
 export async function listUserOffers(userId: string): Promise<any[]> {
-  if (typeof global.mockEnd === 'function') global.mockEnd();
+  if (true) global.mockEnd();
   // TODO: Add DB logic
   return [{ id: 2, senderUserId: 'u1', recipientUserId: 'u2', amount: 5.5 }];

[Timeout] EqualityOperator
src/services/offer.service.ts:22:7
 }
 
 export async function listUserOffers(userId: string): Promise<any[]> {
-  if (typeof global.mockEnd === 'function') global.mockEnd();
+  if (typeof global.mockEnd !== 'function') global.mockEnd();
   // TODO: Add DB logic
   return [{ id: 2, senderUserId: 'u1', recipientUserId: 'u2', amount: 5.5 }];

[Timeout] ObjectLiteral
src/services/offer.service.ts:24:11
 export async function listUserOffers(userId: string): Promise<any[]> {
   if (typeof global.mockEnd === 'function') global.mockEnd();
   // TODO: Add DB logic
-  return [{ id: 2, senderUserId: 'u1', recipientUserId: 'u2', amount: 5.5 }];
+  return [{}];
 }
 
