[Timeout] BlockStatement
src/services/transaction.service.ts:1:90
-export async function listUserTransactions(userId: string, days: number): Promise<any[]> {
-  if (typeof global.mockEnd === 'function') global.mockEnd();
-  // TODO: Add DB logic
-  return [{ id: 3, userId: 'u1', counterpartyUserId: 'u2', balanceAfter: 8 }];
-}
+export async function listUserTransactions(userId: string, days: number): Promise<any[]> {}
 

[Timeout] ConditionalExpression
src/services/transaction.service.ts:2:7
 export async function listUserTransactions(userId: string, days: number): Promise<any[]> {
-  if (typeof global.mockEnd === 'function') global.mockEnd();
+  if (false) global.mockEnd();
   // TODO: Add DB logic
   return [{ id: 3, userId: 'u1', counterpartyUserId: 'u2', balanceAfter: 8 }];

[Timeout] EqualityOperator
src/services/transaction.service.ts:2:7
 export async function listUserTransactions(userId: string, days: number): Promise<any[]> {
-  if (typeof global.mockEnd === 'function') global.mockEnd();
+  if (typeof global.mockEnd !== 'function') global.mockEnd();
   // TODO: Add DB logic
   return [{ id: 3, userId: 'u1', counterpartyUserId: 'u2', balanceAfter: 8 }];

[Timeout] ObjectLiteral
src/services/transaction.service.ts:4:11
 export async function listUserTransactions(userId: string, days: number): Promise<any[]> {
   if (typeof global.mockEnd === 'function') global.mockEnd();
   // TODO: Add DB logic
-  return [{ id: 3, userId: 'u1', counterpartyUserId: 'u2', balanceAfter: 8 }];
+  return [{}];
 }
 

[Timeout] StringLiteral
src/services/transaction.service.ts:4:54
 export async function listUserTransactions(userId: string, days: number): Promise<any[]> {
   if (typeof global.mockEnd === 'function') global.mockEnd();
   // TODO: Add DB logic
-  return [{ id: 3, userId: 'u1', counterpartyUserId: 'u2', balanceAfter: 8 }];
+  return [{ id: 3, userId: 'u1', counterpartyUserId: "", balanceAfter: 8 }];
 }
 
