[Timeout] BlockStatement
src/services/wallet.service.ts:1:56
-export async function getCoinWallet(): Promise<object> {
-  // TODO: Add DB logic
-  return {};
-}
+export async function getCoinWallet(): Promise<object> {}
 
 export async function listCoinWallets(): Promise<any[]> {

[Timeout] BlockStatement
src/services/wallet.service.ts:6:57
   return {};
 }
 
-export async function listCoinWallets(): Promise<any[]> {
-  // TODO: Add DB logic
-  return [];
-}
+export async function listCoinWallets(): Promise<any[]> {}
 

[Timeout] ArrayDeclaration
src/services/wallet.service.ts:8:10
 
 export async function listCoinWallets(): Promise<any[]> {
   // TODO: Add DB logic
-  return [];
+  return ["Stryker was here"];
 }
 
