[Timeout] BlockStatement
src/validation/coin.validation.ts:5:72
 
 const attackPattern = /('|--|;|<script|\bselect\b|\bdrop\b|\bdelete\b|\binsert\b|\bupdate\b|\bexec\b|\bunion\b|\balert\b|\btruncate\b|\bxp_cmdshell\b|\\x[0-9a-f]{2}|"|\*|\||\$|\{|\}|\[|\]|\(|\)|#)/i;
 
-export function validateGrantCoinsInput(opts: GrantCoinsOptions): void {
-  const { actorUserId, targetUserId, amount, serverId } = opts;
-  for (const field of [actorUserId, targetUserId, serverId]) {
-    if (typeof field !== 'string' || field.trim().length === 0 || attackPattern.test(field)) {
-      throw new Error('Missing or malicious user/server info');
-    }
-  }
-  if (typeof amount !== 'number' || isNaN(amount) || !Number.isFinite(amount) || amount <= 1e-6) throw new Error('Invalid amount');
-}
+export function validateGrantCoinsInput(opts: GrantCoinsOptions): void {}
 

[Timeout] BlockStatement
src/validation/coin.validation.ts:7:62
 
 export function validateGrantCoinsInput(opts: GrantCoinsOptions): void {
   const { actorUserId, targetUserId, amount, serverId } = opts;
-  for (const field of [actorUserId, targetUserId, serverId]) {
-    if (typeof field !== 'string' || field.trim().length === 0 || attackPattern.test(field)) {
-      throw new Error('Missing or malicious user/server info');
-    }
-  }
+  for (const field of [actorUserId, targetUserId, serverId]) {}
   if (typeof amount !== 'number' || isNaN(amount) || !Number.isFinite(amount) || amount <= 1e-6) throw new Error('Invalid amount');
 }

[Timeout] EqualityOperator
src/validation/coin.validation.ts:8:9
 export function validateGrantCoinsInput(opts: GrantCoinsOptions): void {
   const { actorUserId, targetUserId, amount, serverId } = opts;
   for (const field of [actorUserId, targetUserId, serverId]) {
-    if (typeof field !== 'string' || field.trim().length === 0 || attackPattern.test(field)) {
+    if (typeof field === 'string' || field.trim().length === 0 || attackPattern.test(field)) {
       throw new Error('Missing or malicious user/server info');
     }

[Timeout] ConditionalExpression
src/validation/coin.validation.ts:8:9
 export function validateGrantCoinsInput(opts: GrantCoinsOptions): void {
   const { actorUserId, targetUserId, amount, serverId } = opts;
   for (const field of [actorUserId, targetUserId, serverId]) {
-    if (typeof field !== 'string' || field.trim().length === 0 || attackPattern.test(field)) {
+    if (true) {
       throw new Error('Missing or malicious user/server info');
     }

[Timeout] LogicalOperator
src/validation/coin.validation.ts:12:7
       throw new Error('Missing or malicious user/server info');
     }
   }
-  if (typeof amount !== 'number' || isNaN(amount) || !Number.isFinite(amount) || amount <= 1e-6) throw new Error('Invalid amount');
+  if ((typeof amount !== 'number' || isNaN(amount) || !Number.isFinite(amount)) && amount <= 1e-6) throw new Error('Invalid amount');
 }
 

[Timeout] ConditionalExpression
src/validation/coin.validation.ts:12:7
       throw new Error('Missing or malicious user/server info');
     }
   }
-  if (typeof amount !== 'number' || isNaN(amount) || !Number.isFinite(amount) || amount <= 1e-6) throw new Error('Invalid amount');
+  if (true) throw new Error('Invalid amount');
 }
 
