[Timeout] BlockStatement
src/validation/offer.validation.ts:6:59
 
 
-export function validateCreateOfferInput(opts: any): void {
-  if (
-    !opts ||
-    typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
-    typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
-    typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6
-  ) {
-    throw new Error('Invalid offer input');
-  }
-}
+export function validateCreateOfferInput(opts: any): void {}
 
 export function validateAcceptOfferInput(opts: any): void {

[Timeout] LogicalOperator
src/validation/offer.validation.ts:8:5
 
 export function validateCreateOfferInput(opts: any): void {
   if (
-    !opts ||
-    typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
+    (!opts || typeof opts.senderUserId !== 'string') && opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
     typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
     typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6

[Timeout] LogicalOperator
src/validation/offer.validation.ts:8:5
 
 export function validateCreateOfferInput(opts: any): void {
   if (
-    !opts ||
-    typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
+    (!opts || typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0) && attackPattern.test(opts.senderUserId.trim()) ||
     typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
     typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6

[Timeout] ConditionalExpression
src/validation/offer.validation.ts:9:46
 export function validateCreateOfferInput(opts: any): void {
   if (
     !opts ||
-    typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
+    typeof opts.senderUserId !== 'string' || false || attackPattern.test(opts.senderUserId.trim()) ||
     typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
     typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6

[Timeout] MethodExpression
src/validation/offer.validation.ts:9:106
 export function validateCreateOfferInput(opts: any): void {
   if (
     !opts ||
-    typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
+    typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId) ||
     typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
     typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6

[Timeout] MethodExpression
src/validation/offer.validation.ts:10:112
   if (
     !opts ||
     typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
-    typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
+    typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId) ||
     typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6
   ) {

[Timeout] EqualityOperator
src/validation/offer.validation.ts:10:49
   if (
     !opts ||
     typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
-    typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
+    typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length !== 0 || attackPattern.test(opts.recipientUserId.trim()) ||
     typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6
   ) {

[Timeout] ConditionalExpression
src/validation/offer.validation.ts:11:5
     !opts ||
     typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
     typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
-    typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6
+    false || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6
   ) {
     throw new Error('Invalid offer input');

[Timeout] EqualityOperator
src/validation/offer.validation.ts:11:95
     !opts ||
     typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
     typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
-    typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6
+    typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount > 1e-6
   ) {
     throw new Error('Invalid offer input');

[Timeout] BlockStatement
src/validation/offer.validation.ts:12:5
     typeof opts.senderUserId !== 'string' || opts.senderUserId.trim().length === 0 || attackPattern.test(opts.senderUserId.trim()) ||
     typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
     typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6
-  ) {
-    throw new Error('Invalid offer input');
-  }
+  ) {}
 }
 

[Timeout] StringLiteral
src/validation/offer.validation.ts:13:21
     typeof opts.recipientUserId !== 'string' || opts.recipientUserId.trim().length === 0 || attackPattern.test(opts.recipientUserId.trim()) ||
     typeof opts.amount !== 'number' || !Number.isFinite(opts.amount) || isNaN(opts.amount) || opts.amount <= 1e-6
   ) {
-    throw new Error('Invalid offer input');
+    throw new Error("");
   }
 }

[Timeout] BlockStatement
src/validation/offer.validation.ts:17:59
   }
 }
 
-export function validateAcceptOfferInput(opts: any): void {
-  if (
-    !opts ||
-    typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0
-  ) {
-    throw new Error('Invalid accept offer input');
-  }
-  if (attackPattern.test(opts.userId)) {
-    throw new Error('Potentially malicious input detected');
-  }
-}
+export function validateAcceptOfferInput(opts: any): void {}
 
 export function validateCancelOfferInput(opts: any): void {

[Timeout] BooleanLiteral
src/validation/offer.validation.ts:19:5
 
 export function validateAcceptOfferInput(opts: any): void {
   if (
-    !opts ||
+    opts ||
     typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
     typeof opts.userId !== 'string' || opts.userId.trim().length === 0

[Timeout] ConditionalExpression
src/validation/offer.validation.ts:19:5
 
 export function validateAcceptOfferInput(opts: any): void {
   if (
-    !opts ||
-    typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0
+    false
   ) {
     throw new Error('Invalid accept offer input');

[Timeout] EqualityOperator
src/validation/offer.validation.ts:20:75
 export function validateAcceptOfferInput(opts: any): void {
   if (
     !opts ||
-    typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
+    typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId > 0 ||
     typeof opts.userId !== 'string' || opts.userId.trim().length === 0
   ) {

[Timeout] BooleanLiteral
src/validation/offer.validation.ts:20:41
 export function validateAcceptOfferInput(opts: any): void {
   if (
     !opts ||
-    typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
+    typeof opts.offerId !== 'number' || Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
     typeof opts.userId !== 'string' || opts.userId.trim().length === 0
   ) {

[Timeout] ConditionalExpression
src/validation/offer.validation.ts:21:5
   if (
     !opts ||
     typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0
+    false || opts.userId.trim().length === 0
   ) {
     throw new Error('Invalid accept offer input');

[Timeout] EqualityOperator
src/validation/offer.validation.ts:21:40
   if (
     !opts ||
     typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0
+    typeof opts.userId !== 'string' || opts.userId.trim().length !== 0
   ) {
     throw new Error('Invalid accept offer input');

[Timeout] BlockStatement
src/validation/offer.validation.ts:22:5
     !opts ||
     typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
     typeof opts.userId !== 'string' || opts.userId.trim().length === 0
-  ) {
-    throw new Error('Invalid accept offer input');
-  }
+  ) {}
   if (attackPattern.test(opts.userId)) {
     throw new Error('Potentially malicious input detected');

[Timeout] StringLiteral
src/validation/offer.validation.ts:23:21
     typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
     typeof opts.userId !== 'string' || opts.userId.trim().length === 0
   ) {
-    throw new Error('Invalid accept offer input');
+    throw new Error("");
   }
   if (attackPattern.test(opts.userId)) {

[Timeout] ConditionalExpression
src/validation/offer.validation.ts:25:7
   ) {
     throw new Error('Invalid accept offer input');
   }
-  if (attackPattern.test(opts.userId)) {
+  if (true) {
     throw new Error('Potentially malicious input detected');
   }

[Timeout] ConditionalExpression
src/validation/offer.validation.ts:25:7
   ) {
     throw new Error('Invalid accept offer input');
   }
-  if (attackPattern.test(opts.userId)) {
+  if (false) {
     throw new Error('Potentially malicious input detected');
   }

[Timeout] StringLiteral
src/validation/offer.validation.ts:26:21
     throw new Error('Invalid accept offer input');
   }
   if (attackPattern.test(opts.userId)) {
-    throw new Error('Potentially malicious input detected');
+    throw new Error("");
   }
 }

[Timeout] BlockStatement
src/validation/offer.validation.ts:30:59
   }
 }
 
-export function validateCancelOfferInput(opts: any): void {
-  if (
-    !opts ||
-    typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0
-  ) {
-    throw new Error('Invalid cancel offer input');
-  }
-  if (attackPattern.test(opts.userId)) {
-    throw new Error('Potentially malicious input detected');
-  }
-}
+export function validateCancelOfferInput(opts: any): void {}
 

[Timeout] ConditionalExpression
src/validation/offer.validation.ts:32:5
 
 export function validateCancelOfferInput(opts: any): void {
   if (
-    !opts ||
-    typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0
+    true
   ) {
     throw new Error('Invalid cancel offer input');

[Timeout] ConditionalExpression
src/validation/offer.validation.ts:33:75
 export function validateCancelOfferInput(opts: any): void {
   if (
     !opts ||
-    typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
+    typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || false ||
     typeof opts.userId !== 'string' || opts.userId.trim().length === 0
   ) {

[Timeout] EqualityOperator
src/validation/offer.validation.ts:33:5
 export function validateCancelOfferInput(opts: any): void {
   if (
     !opts ||
-    typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
+    typeof opts.offerId === 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
     typeof opts.userId !== 'string' || opts.userId.trim().length === 0
   ) {

[Timeout] MethodExpression
src/validation/offer.validation.ts:34:40
   if (
     !opts ||
     typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0
+    typeof opts.userId !== 'string' || opts.userId.length === 0
   ) {
     throw new Error('Invalid cancel offer input');

[Timeout] BlockStatement
src/validation/offer.validation.ts:35:5
     !opts ||
     typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
     typeof opts.userId !== 'string' || opts.userId.trim().length === 0
-  ) {
-    throw new Error('Invalid cancel offer input');
-  }
+  ) {}
   if (attackPattern.test(opts.userId)) {
     throw new Error('Potentially malicious input detected');

[Timeout] StringLiteral
src/validation/offer.validation.ts:36:21
     typeof opts.offerId !== 'number' || !Number.isFinite(opts.offerId) || opts.offerId <= 0 ||
     typeof opts.userId !== 'string' || opts.userId.trim().length === 0
   ) {
-    throw new Error('Invalid cancel offer input');
+    throw new Error("");
   }
   if (attackPattern.test(opts.userId)) {

[Timeout] BlockStatement
src/validation/offer.validation.ts:38:40
   ) {
     throw new Error('Invalid cancel offer input');
   }
-  if (attackPattern.test(opts.userId)) {
-    throw new Error('Potentially malicious input detected');
-  }
+  if (attackPattern.test(opts.userId)) {}
 }
 
