[Survived] BlockStatement
src/validation/transaction.validation.ts:3:87
 const attackPattern = /('|--|;|<script|\bselect\b|\bdrop\b|\bdelete\b|\binsert\b|\bupdate\b|\bexec\b|\bunion\b|\balert\b|\btruncate\b|\bxp_cmdshell\b|\\x[0-9a-f]{2}|"|\*|\||\$|\{|\}|\[|\]|\(|\)|#)/i;
 
-export function validateListUserTransactionsInput(userId: string, days: number): void {
-  if (
-    typeof userId !== 'string' || userId.trim().length === 0 || attackPattern.test(userId) ||
-    typeof days !== 'number' || !Number.isFinite(days) || isNaN(days) || days <= 1e-6
-  ) {
-    throw new Error('Invalid transaction query input');
-  }
-}
+export function validateListUserTransactionsInput(userId: string, days: number): void {}
 

[Survived] EqualityOperator
src/validation/transaction.validation.ts:5:35
 
 export function validateListUserTransactionsInput(userId: string, days: number): void {
   if (
-    typeof userId !== 'string' || userId.trim().length === 0 || attackPattern.test(userId) ||
+    typeof userId !== 'string' || userId.trim().length !== 0 || attackPattern.test(userId) ||
     typeof days !== 'number' || !Number.isFinite(days) || isNaN(days) || days <= 1e-6
   ) {

[Survived] ConditionalExpression
src/validation/transaction.validation.ts:5:35
 
 export function validateListUserTransactionsInput(userId: string, days: number): void {
   if (
-    typeof userId !== 'string' || userId.trim().length === 0 || attackPattern.test(userId) ||
+    typeof userId !== 'string' || false || attackPattern.test(userId) ||
     typeof days !== 'number' || !Number.isFinite(days) || isNaN(days) || days <= 1e-6
   ) {

[Survived] EqualityOperator
src/validation/transaction.validation.ts:6:5
 export function validateListUserTransactionsInput(userId: string, days: number): void {
   if (
     typeof userId !== 'string' || userId.trim().length === 0 || attackPattern.test(userId) ||
-    typeof days !== 'number' || !Number.isFinite(days) || isNaN(days) || days <= 1e-6
+    typeof days === 'number' || !Number.isFinite(days) || isNaN(days) || days <= 1e-6
   ) {
     throw new Error('Invalid transaction query input');

[Survived] EqualityOperator
src/validation/transaction.validation.ts:6:74
 export function validateListUserTransactionsInput(userId: string, days: number): void {
   if (
     typeof userId !== 'string' || userId.trim().length === 0 || attackPattern.test(userId) ||
-    typeof days !== 'number' || !Number.isFinite(days) || isNaN(days) || days <= 1e-6
+    typeof days !== 'number' || !Number.isFinite(days) || isNaN(days) || days > 1e-6
   ) {
     throw new Error('Invalid transaction query input');

[Survived] BlockStatement
src/validation/transaction.validation.ts:7:5
   if (
     typeof userId !== 'string' || userId.trim().length === 0 || attackPattern.test(userId) ||
     typeof days !== 'number' || !Number.isFinite(days) || isNaN(days) || days <= 1e-6
-  ) {
-    throw new Error('Invalid transaction query input');
-  }
+  ) {}
 }
 

[Survived] StringLiteral
src/validation/transaction.validation.ts:8:21
     typeof userId !== 'string' || userId.trim().length === 0 || attackPattern.test(userId) ||
     typeof days !== 'number' || !Number.isFinite(days) || isNaN(days) || days <= 1e-6
   ) {
-    throw new Error('Invalid transaction query input');
+    throw new Error("");
   }
 }
