[Survived] Regex
src/validation/wallet.validation.ts:1:23
-const attackPattern = /('|--|;|<script|\bselect\b|\bdrop\b|\bdelete\b|\binsert\b|\bupdate\b|\bexec\b|\bunion\b|\balert\b|\btruncate\b|\bxp_cmdshell\b|\\x[0-9a-f]{2}|"|\*|\||\$|\{|\}|\[|\]|\(|\)|#)/i;
+const attackPattern = /('|--|;|<script|\bselect\b|\bdrop\b|\bdelete\b|\binsert\b|\bupdate\b|\bexec\b|\bunion\b|\balert\b|\btruncate\b|\bxp_cmdshell\b|\\x[^0-9a-f]{2}|"|\*|\||\$|\{|\}|\[|\]|\(|\)|#)/i;
 
 export function validateGetCoinWalletInput(opts: any): void {

[Survived] BlockStatement
src/validation/wallet.validation.ts:3:61
 const attackPattern = /('|--|;|<script|\bselect\b|\bdrop\b|\bdelete\b|\binsert\b|\bupdate\b|\bexec\b|\bunion\b|\balert\b|\btruncate\b|\bxp_cmdshell\b|\\x[0-9a-f]{2}|"|\*|\||\$|\{|\}|\[|\]|\(|\)|#)/i;
 
-export function validateGetCoinWalletInput(opts: any): void {
-  if (
-    !opts ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0 || attackPattern.test(opts.userId)
-  ) {
-    throw new Error('Invalid wallet input');
-  }
-}
+export function validateGetCoinWalletInput(opts: any): void {}
 

[Survived] LogicalOperator
src/validation/wallet.validation.ts:5:5
 
 export function validateGetCoinWalletInput(opts: any): void {
   if (
-    !opts ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0 || attackPattern.test(opts.userId)
+    !opts && typeof opts.userId !== 'string' || opts.userId.trim().length === 0 || attackPattern.test(opts.userId)
   ) {
     throw new Error('Invalid wallet input');

[Survived] LogicalOperator
src/validation/wallet.validation.ts:5:5
 
 export function validateGetCoinWalletInput(opts: any): void {
   if (
-    !opts ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0 || attackPattern.test(opts.userId)
+    (!opts || typeof opts.userId !== 'string' || opts.userId.trim().length === 0) && attackPattern.test(opts.userId)
   ) {
     throw new Error('Invalid wallet input');

[Survived] ConditionalExpression
src/validation/wallet.validation.ts:6:5
 export function validateGetCoinWalletInput(opts: any): void {
   if (
     !opts ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0 || attackPattern.test(opts.userId)
+    false || opts.userId.trim().length === 0 || attackPattern.test(opts.userId)
   ) {
     throw new Error('Invalid wallet input');

[Survived] ConditionalExpression
src/validation/wallet.validation.ts:6:40
 export function validateGetCoinWalletInput(opts: any): void {
   if (
     !opts ||
-    typeof opts.userId !== 'string' || opts.userId.trim().length === 0 || attackPattern.test(opts.userId)
+    typeof opts.userId !== 'string' || false || attackPattern.test(opts.userId)
   ) {
     throw new Error('Invalid wallet input');

[Survived] BlockStatement
src/validation/wallet.validation.ts:7:5
   if (
     !opts ||
     typeof opts.userId !== 'string' || opts.userId.trim().length === 0 || attackPattern.test(opts.userId)
-  ) {
-    throw new Error('Invalid wallet input');
-  }
+  ) {}
 }
 
